{"meta":{"title":"Allen2010 Blog","subtitle":"Explore Here!","description":"BlackBasalt","author":"Allenyang","url":"https://allen2010.github.io","root":"/"},"pages":[{"title":"文章分类","date":"2021-01-25T14:37:25.000Z","updated":"2025-03-16T00:12:10.637Z","comments":true,"path":"categories/index.html","permalink":"https://allen2010.github.io/categories/index.html","excerpt":"","text":""},{"title":"About","date":"2025-03-21T13:33:01.000Z","updated":"2025-04-13T13:32:09.466Z","comments":true,"path":"about/index.html","permalink":"https://allen2010.github.io/about/index.html","excerpt":"","text":"About Me I’m Allen2010, as known as “Allen_yang” in Luogu, a Chinese 8th grade students. 大家好，这里是 Allen2010 的博客。我是一名中国北京市初二学生，在洛谷账号为 Allen_yang(uid:683768)。一名很菜的 OIer，低端的小说家和落魄的理科生。虽打着信息学竞赛生的名号，却主攻文化课。擅长数学，物理略好，其他的中等偏上。主要爱好目前有： 写小说，以奇幻、冒险或其他非传统网络小说为主题 学算法，写代码，顺便发表算法笔记 打 Atcoder 和 Luogu 比赛 设计建筑，重要应用 Sketch Up 草图大师 自然风光，例如 热带稀树草原 温带疏林草原 热带雨林 海滩 雪景 打羽球（反正你也看不到） Blog Topic我将在这个博客上发表一些自己原创的文章，分类的介绍如下 Note 算法笔记学习算法后的感悟、总结以及对算法实现的见解 Works 建模渲染作品、画作建模作品的渲染图、作品介绍以及理念。建筑设计为主。 Essay 随笔随笔。 Novel 小说个人爱好，文笔不佳。以奇幻、冒险等元素构成的小说（也可能是片段），风格新奇。 Favourite 爱好大概是关于主要爱好的一些杂念，无关紧要。 History本博客搭建于 2024 年，应用于 2025 年。经历从 volantis 到 NexT 再到 Redefine 主题的转变，我的审美和风格发生了很大转变。现在，文笔将以简洁明了为主，去除骈文式的繁杂语句和自创揉词awa。"},{"title":"","date":"2025-02-26T13:36:12.282Z","updated":"2025-02-26T13:36:12.282Z","comments":true,"path":"css/custom.css","permalink":"https://allen2010.github.io/css/custom.css","excerpt":"","text":"@font-face { /* 为载入的字体取名字(随意) */ font-family: 'LXGWWenKai-Regular'; /* 字体文件地址(相对或者绝对路径都可以) */ src: url(fonts/TTF/LXGWWenKai-Regular.ttf); /* 定义加粗样式(加粗多少) */ font-weight: normal; /* 定义字体样式(斜体/非斜体) */ font-style: normal; /* 定义显示样式 */ font-display: block; }"},{"title":"FRIENDS","date":"2025-01-27T04:21:54.497Z","updated":"2025-01-27T04:21:54.497Z","comments":true,"path":"friends/index.html","permalink":"https://allen2010.github.io/friends/index.html","excerpt":"","text":""},{"title":"Friends","date":"2025-03-27T12:32:07.000Z","updated":"2025-03-27T12:32:49.681Z","comments":true,"path":"links/index.html","permalink":"https://allen2010.github.io/links/index.html","excerpt":"","text":""},{"title":"标签","date":"2021-01-25T14:54:58.000Z","updated":"2025-03-16T00:11:06.974Z","comments":true,"path":"tags/index.html","permalink":"https://allen2010.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Minecraft Fantastic Scenery","slug":"minecraft scenery","date":"2025-06-24T09:12:57.000Z","updated":"2025-06-24T09:20:42.988Z","comments":true,"path":"2025/06/24/minecraft scenery/","permalink":"https://allen2010.github.io/2025/06/24/minecraft%20scenery/","excerpt":"I collected some minecraft wallpapers with fascinating shaders and resource packs.","text":"Photon Shaders SPBR Resource Pack I hope you like all of the above！","categories":[{"name":"Favourite","slug":"Favourite","permalink":"https://allen2010.github.io/categories/Favourite/"}],"tags":[{"name":"minecraft","slug":"minecraft","permalink":"https://allen2010.github.io/tags/minecraft/"},{"name":"wall paper","slug":"wall-paper","permalink":"https://allen2010.github.io/tags/wall-paper/"}]},{"title":"Outerside Legend No.2","slug":"Outerside2","date":"2025-05-19T13:36:32.000Z","updated":"2025-08-08T11:18:50.868Z","comments":true,"path":"2025/05/19/Outerside2/","permalink":"https://allen2010.github.io/2025/05/19/Outerside2/","excerpt":"When you Failed.","text":"中部 Failed of the Mind 败于执念Written by：AllEnDlLes(Allenec2010) VIII Solktorahe FortressTco刚拔出剑的手僵住了。“放下武器，否则你的朋友就没命了。”法师冷冷地说，Tco缓缓抽出剑，扔在了地上。法师冷笑了两声。“唉……被情谊束缚住的人，就是不堪一击……”法师嘲讽的说，用手释放了电击，折磨着Mrs。Mrs不住的惨叫。Tco看着同伴的眼泪，沉默的低下了头。突然，他上前一步，法师警觉地停住了手，可令人难以置信的是Tco却对法师伸出了手，然后单膝跪地，虔诚地说：“我愿意和你合作，再创辉煌。”Mrs震惊了，他大喊着Tco的名字，随机被嘴角上扬的法师扔到了地上。法师带着Tco头也不回的离开了。出门前的一刻，Tco突然回头，眼睛发出了紫色的光。Mrs摇了摇头，站了起了。他颓废的再次坐在地上，不敢相信。他的朋友，强大的伦诺克斯Tco，竟然背叛了他，和堕落的法师同流合污。促使他堕落的，是什么呢？正在Mrs疑惑之时，只听得走廊外传来了巨大的炸裂和尖锐的惨叫声，然后Tco光速闪到了眼前，拉着Mrs的手飞奔出了走廊，一跃而下几十层楼梯，跑进了树林里。两人不顾死活，只顾着飞速地逃命。他们错过了后来ElcTdl他们住宿的地方，错过了城门的守卫，错过了沙漠上飞驰的野兽……总之，不知跑了多久，他们停了下来，欧瑞克城早已被远远甩在了身后。仔细回想一下，他们貌似是从城墙上的一个小洞里钻出来的。眼下，他们伸出沙漠，而且天色渐晚，连夜赶路看来是不行了。休整之时，Mrs不禁疑惑，问：“你为什么跟随了他，却带我逃出来了？”Tco笑了笑，回答：“看来你没看懂我的眼神。我的意思是：诈降，快跑。后来我发现他根本没有实体，所以直接用燃烧着地狱火的剑把他斩了。当然，他的灵魂不死不灭。我以为儿时这么多年的配合让你能很轻松的明白呢……”他摇了摇头，坐在了地上。“谢谢你赶过来帮助我。”“哪里，我一直都没走，只不过听说最近有几个黑影向欧瑞克飞过去了。觉得不对劲就骑着飞兽跟了上去。进了城，一打听发现真出事了。所以我就伪装成新来的守卫，然后骗取了法师的信任。当然，经过这一次事故恐怕我的爵位就要没了。我的前途好迷茫，我的妻子孩子该怎么办？”Tco想了想，说：“在须弥，有个美丽的小镇，叫埃兰塔尔。你可以去那里，我正好有个朋友，到时候帮你找个工作，勉强先住下去吧。”“那就太感谢了。不过我们得先想办法离开沙漠。伦诺克斯肯定有办法。”Mrs笑了起来。“那当然。哨~”Tco吹了个口哨，天边出现了两个小点。过了一会，小点越来越大，最终变成两只巨大的飞兽，降落在了Tco面前。“走吧，精灵送给我的小宠物。” “于是我和你父亲Mrs就离开了欧瑞克。后来，我听说他在远方遭遇了不测，就赶过去看，不料只赶上了葬礼。后来听乡亲们的解释，分析分析大概凑出了个完整的故事。这就是我第一次去欧瑞克的事了。后来，你们也知道了，我想要救回我的伙伴，就临时组建了军队攻打安德森，被国王的卫队打的落花流水。在法师们魔影的作用下，人们再也不相信我了。我没办法，就回到格兰陵来了。告诉你个秘密：我就是星光格兰的幻化伦诺克斯，所以敢住在这里。这就是我的故事了，怎么样？”Tco喝了口茶，看着Tdl。Tdl还陷在Tco回忆里，猛地被Elc叫了起来。“呃……嗯！”Tdl敷衍了几句，Tco笑了起来。在他沧桑的脸上，依稀能看到当年那个意气风发的少年的影子。“今后你们打算怎么样？”Tco问。“不知道。完成我的使命吧。”Tdl想了想。“可你一个人，怎么完成呢？”“嗯……也是。”“那不如你现在我这里住一阵子，到时候我们想想计划，再去把法师除掉。他的魔影会影响我们的使命进程。顺便解脱我的伙伴也不是不可能。而且这段时间你要好好磨练自己的技能，你的实力还没有完全开发。”Tco提出了邀请，Tdl本来是拒绝的，因为这里住不下。然而……“怎么样？曾经的乌顿之王可不是名不虚传的。”当Tco带着Tdl来到了那座“城堡”前时，Tdl再也忍不住了。于是他爽快地答应了请求。好吧，我承认这只是站在那个世界观时代背景的视角下看待的这座城堡，或者被Tdl成为“要塞”，但是就算是放在现实现代也是相当前卫的建筑。要塞的外形并不惹人眼目，仅仅是由若干个柱形结构和其中穿插的立方矩体构成的一座中型堡垒，上面雕刻着蓝色和灰白色的花纹。，其中作为地基的平台台有嵌入山脊，因此连接了庞大的山内系统和山外系统。当然，我知道你们想说无图无真相，但是图片还没做好，所以请各位等一两年，马上就会有结果。“这是哪来的要塞？”Tdl饶有兴趣。“还能使哪来的，自己盖的呗。”Tco笑了笑，“花了我和村民们12个年头。”从山底爬到山腰，Tco带着二人走进了要塞的大门。他们顺着大厅的旋转楼梯一路向下，走到了一个隧道前。隧道的四周用木料围着，火把的烟味和木料的药香混合在一起，氛围感十足。Tdl继续往前走，幽幽的火把突然变成了紫红色，随机又变了回去，Tdl吓了一跳，Tco解释道：“别担心，不过是感应到你走进了。这是一种特殊的燃烧材料，一旦和咱们呼出的纯二氧化碳相结合，颜色就变了。”Tdl歪了歪脑袋，挑了一下眉毛，继续往前走。他注意到隧道墙壁上有许多门，应该是连着房间的，上面写着一串串数字。Tdl边数边走，从M1001数到了M1069时，Tco停了下来。“M1069，这就是你们在这里的家。记住了，别走错了。我的房间在M1037，如果你想好了可以去找我。我一般都在里面。”Tco说，递给了Tdl一把奇怪的改锥一样的东西。“这是你们的钥匙，再见。”Tdl转动改锥，打开了房门，里面是一个巨大的房间。“这12年没白花。得有150平米了吧？”Elc感叹。“我看得有200以上。。好吧，从今天起就是咱们的家了。”Tdl走到了窗户前面，俯瞰着索科特拉盆地的自然景观。热带雨林，草原，山川还有海洋，这一切，宛如一片虚幻的天堂，映入了Tdl的眼帘。“不得不说，Tco选址的地方太好了。”过了一会，Tdl坐在了沙发上，他仔细回想着自己去欧瑞克时的各个片段，仔细寻找着法师的弱点。魔影？这意味着我们只能孤军深入，无法维持民心……那我们是不是可以拉拢他们？不，法师显然想到了这一点……那能不能让百姓们看清眼前的事实？这是最好的选择，但是难以实现……不知过了多久，Elc走了过来，坐在Tdl旁边说：“今天好晒呀……咱们去吃午饭吧。”晒？阳关？光？对了，星光！法师最惧怕的就是光，尤其是夜晚漆黑衬托出的耀眼的星光。我们只需要让百姓们对星光心存敬畏，法师们的算盘就不攻自破了。Tdl长出一口气，他意识到了Sr说得对，他离成为合格的伦诺克斯还有很远的路。“你先去吧，我去和Tco商量点事。”Tdl说，转头却发现Elc已经离开了。他无奈地走出房门，向“餐厅”走去。餐厅在山体上面，一个小亭子里。所以与其说是餐厅，不如说是一个简单版野餐垫，吃什么取决于厨师的心情，想带什么就带什么，一切全靠运气。“先吃饭，吃完饭也不迟。”他想。 IX Missing今天的“厨师”Als十分随便，也就带了点十分不和Tdl胃口的沙丁鱼披萨（！！！）和沙丁鱼罐头。不知道他怎么想的，可能是家里住在海边吧。反正具吃完饭的Elc说，“我tm这辈子吃过的东西里只有小时候吞下去的烟草比它难吃。”不过不知为何，Tdl今天胃口异常好，或许是看见了明天的太阳，因此反常态地吃了两块披萨。但是吃完就去厕所了，不知道去干嘛。Tdl出来时，Elc已经回家了。于是他一人走下蜿蜒的楼梯，下到-1层，找到了隐藏深奥的M1037。“咚咚咚！”Tdl敲了敲门，随机门打开了。Tdl定睛一看，却是一张陌生的脸。“你是谁？”那个人问，“来找谁？”“我来找Tco。他不在吗？还是我走错了？”Tdl疑惑的转头确认了一下门牌。“呃，没有。刚才Tco去吃午饭了，你没看见他吗？”看起来那个人也很疑惑。“啊？我刚回来，没见着他呀。虽然中途我去了趟厕所，但一直没看见亭子里有他。”Tdl撇了撇嘴。”没事，习惯就好。如果你一定要照他的话，今晚九点再过来，他应该就回来了。”那个开门的人说，“顺便介绍一下，我叫Ofd，是他的朋友。”Ofd递给了Tdl一张名片。“幸会，我叫Tdl，也是一名伦诺克斯，临时来找他。”Tdl也掏出了自己的名片，然后发现没带，尴尬的笑了笑。对方倒是不反感，反而友好的和Tdl握了握手。随后Tdl就回到自己家了。Elc已经在等他，而且手里拿着一张破破烂烂的纸。Elc笑了一下，但是装的不好，Tdl一眼就看出来他发现了什么坏消息。“给你看看，吃饭的时候听旁边的那个胖子Sam说的。”Elc把纸递给了Tdl。Tdl细看着上面潦草的字迹，拼凑出了一段信息：Tco前往萨鲁曼德办事，失踪。多次派人寻找，只找到了他的披风和佩剑。“好家伙，这下完蛋了。”Tdl狠狠地把纸片撕碎了一地。”不嫌麻烦地话，跟我走一趟。”Tdl径直上了楼梯，来到了要塞的武器库前面。他径直走向那个中午喝了两瓶朗姆现在醉醺醺躺在门口的胖子。“嘿，Sam！”Tdl拍了拍山姆的肩膀，“醒醒啊，山姆！”可山姆只是晃了晃脑袋，转了个姿势继续睡觉。“Sam大人，请帮我个忙，事成我可以提供你一天所需的朗姆酒！”Tdl被逼急了。可Sam非但不为所动，反而看都没看一眼，撇下一句：“你这句话我已经听了不下10遍了。别仗着自己是Tco那个糨糊的心腹就过来要挟我，你是什么人我摸的一清二楚。”“你……”Tdl彻底怒了，要不是Elc紧紧抓住他的胳膊，估计山姆早就断成商鞅了。“好吧，既然事到此处，只能找他了。”Tdl说。“跟我来一趟。”“看来你这几天再这里混得不怎么样啊。”Elc苦笑着。“可不是嘛。快走吧，他们天天找我比武，每一个能跟我这个菜鸟打上5招。对了，M1037，就是这里。”Tdl无奈的说。其实他心里很清楚，那些人只是看他年轻给他点面子罢了，奈何Tdl自从Sr离世后就变得喜怒无常，除了他最信任的Elc外对其他人都很冷漠。于是他敲了敲房门，等待Ofd的出现。“怎么了，找我什么事？”Ofd走了出来，身上挂满了不知名的挂坠。“Tco失踪了，你听说了吗？”Tdl急忙问。“嗯。当然，已经派人去找了，你还是先想想Tco对你说的话吧。分析清楚自己的处境了吗？我说的是你作为……”“当然，但这不重要。重要的是他失踪了，现在这个要塞就成了个纸老虎，一具空壳，没有……”“你别以为我们这些人都是游手好闲的。就算没有他，索科特拉要塞也不可能倒塌。”Ofd仿佛变了个人，说话极其刻薄，不留余地。“好，但是我在求你，求你帮忙，给我些人手。我亲自去找。”“不，这世上本就没多少像你这样的人了。Tco大人留给我的最后一句话就是让你好好呆在这里，不要擅自去找麻烦。你还小，这世上远比你想象中凶险德多。”“荷，他还真把我当他儿子了。好，连你都不愿意帮我，那我自己去。再会！”Tdl不客气地说。Ofd显然也被吓了一跳，他紧咬嘴唇，关上了门。“哥，冷静一下，不要被情感所左右，要理性！理性！”Elc拽着Tdl的胳膊，拼命阻止他前进，但Tdl却甩开他，狠狠留下一句：“懦夫！见死不救，何以成为伦诺克斯！要是连你都不信任我，那就随你去吧，让我自己面对所有的重任！”他转身，头也不回地走上了楼梯。怎么会这样？Tdl到底受了什么刺激？他明知道这次旅程有去无回，还要逞强，这其中定是有什么隐情。Elc想，他明白，现在不是根Tdl白扯谁tm是懦夫的时间，如果不保证Tdl不会被法师薄纱，那么一切扳局的念想都会化成UD一般。静想了一会之后，Elc做了决定。他悄悄跟在后面，带上了自己从未使用过的附魔长剑。不知不觉，要塞外早已下起了大雨，Elc一人踏着泥浆，勉强能看见远方Tdl的油灯发出的微弱亮光。不知不觉，他想，Tdl变了，他自从和法师接触后就变得阴沉，易怒。曾经那个天真无邪的少年早已不见，如今却多出了个令人捉摸不透的冰冷法师。但愿，但愿他心中还有希望，他的理智终将会战胜情感。但愿，但愿……Elc仰头，看着阴云密布的天空，十分压抑。或许这就是伦诺克斯心中的阴雨把，没有友谊，没有星光，没有希望。只有突破这层阴雨，方能见到明天的星空，见到新的希望。“愿星光璀璨，Tdl的重回成为现实。”Elc低声说，“愿一切安好……”转眼间，Elc发现自己已经走出了索科特拉盆地，来到了新乌顿平原。再往前，就是萨鲁曼德了。远处Tdl的光影还在往前走，但明显，脚步不如之前那么快，也有可能是Elc轻盈的步伐追上了他，总之，两人之间的距离已经不超过400米了，Elc快速向前追去，追回在阴云中越走越远的光。 一路上，Tdl浑身已经被雨水和汗水浸透，他开始感到不安。Elc说的没错，自己一个人，就算是找到了Tco又能做什么？凭Tco的实力，不可能会迷路或者在半路生病饿死。显然，这是阴谋。他不禁想起了Sr的遭遇。但既然走了，就不能回头，就算是走亖，哪怕只要找到Tco也行，哪怕自己已经落入陷阱也行，总之，往前走就是了。自己的价值远没有Tco大，Tdl想，只要Tco能逃脱，一切都会有转机。可真的是这样吗？“你小子，果然还是太年轻了！”远在欧尔克的宫殿了，法师之首萨托罗从那枚贡多水晶里注视着狼狈不堪的Tdl，狂笑不止。“要不是那个该死的寓言，我怎么都不会相信你就是传说中的埃努诺尔……不论怎样，今日就是你的死期！” X A West of WillTdl继续往前深入，早已越过了萨鲁曼德的边界，不知不觉走到了一片丘陵中。他抬头远望，不知道Tco到底在哪里。不经意间，他注意到了身前的一团紫光，看着那紫光好像有某种魔法，引领着Tdl往前走，但Tdl哪里是等闲之辈，并没有跟随着紫光，而是另辟蹊径，顺着自己所感知的路继续往前走。雨停了，但是太阳再也不会出来了。天色已黑透，Tdl坐了下来，心里五谷杂粮。Elc抓紧时机赶了上去但是Tdl没有注意他。他随手从旁边的小花小草里找了拔了几个青果子，塞在嘴里充饥，然后把湿透的斗篷和衣服脱下，枕在脑袋下面沉沉睡去。Elc没有上前打扰，而是拿出箭袋，抽出了一根紫红的长箭，抚摸着箭杆和翎羽。次日凌晨，Elc早已睡死过去，Tdl反倒醒了过来。他依旧没有注意到Elc，而是继续向前，爬上了眼前这座高得离谱却生机盎然的丘陵。哪怕这些，在Tdl眼里也不过如同草芥，因为他感到Tco近了，越来越近了。等待Elc醒来时，Tdl早已不见了人影。凭Elc对他的了解，是眼前这座丘陵没错了。于是他收起箭袋，背上长弓，向着顶峰爬去。这座丘陵看着不大，但是爬起来就觉得仿佛是通向天堂一般，不仅山路陡峭，而且四周全™是草地和滑溜溜的蕨类已经哪些罪该万死的扎手松柏，没有任何抓握的地方，再加上昨夜的那场暴雨，就算是香山那种级别，也是能把人累死。Elc不是人类，他是精灵，但就算是精灵他的体力也有用完的时候。爬到半山腰时，Elc已经气喘吁吁，腰酸背痛了。可是Tdl仍然不见踪影。好早从山腰开始，草变少了，反倒是一些古藤老根变得越来越多。不过Elc还是在山腰处休息了好长一会，顺便吃了点干粮。看着远处熟悉的森林和河流，他一度入了迷，忘记了爬山。好一会，他才反应过来，时间已经到了正午。不知怕了多久，树木渐渐稀疏，草地和蕨类茂盛了起来，Elc总算是来到了接近顶部的位置。宽阔的平台上，Tdl屹立在上，他面前是一个黑衣兜帽的人，手紧紧攥着一条绳子。绳子的另一端，正是被捆住的Tco，他昏了过去，不省人事。显然，Tdl也是刚刚才上来的。因为Elc听见了法师的话：“怎么样，老兄，终于见面了。我想不到你这么快就落入了陷阱，真令我失望！”Tdl没有说话。他抽出长剑，深深的插在了泥地里。过了一会，他缓缓说：“什么条件？”“没有条件，要的就是你。”黑衣人缓缓说。“干掉碍事的！”他打了个响指，随后在山后面走上来了另一个黑衣人，他手拿长剑，直取Elc。Tdl方才反应过来Elc一直尾随他而来，但还没等他表示感激与歉意，就听得咔嚓一声，Elc的长弓应声断裂，Elc赶忙抽出刀，与黑衣人对抗。Elc无心恋战。尽管他的剑法精细灵活，但多方的实力也不容小觑，手中的长剑如毒蛇般八方出动，无法预判。Elc单手扛下了对方的致命一击，但随即就被鬼影般的第二次进攻打得连连后退。显然黑衣人的剑法比Elc高超，几个回合，Elc就被逼到了悬崖边。Elc最终体会到了什么叫绝望。他拼劲全力使出最后一击，刀剑相撞，刺耳的声音震得人耳膜发痒。没有机会了，Elc想。明日的太阳我再也见不到了……突然，黑影一闪，黑衣人被Tdl的长剑刺穿了胸膛。可没想到黑衣人仍不死心，他临死前从背后取下小圆盾，狠狠地砸向Elc。Elc面临着一击，像掉落的羽毛般横飞出去，坠下了悬崖。“Tdl！你有潜力，不要妄自菲薄！不要为了仇恨而战！你的使命是守护！是引领！Td……”Elc下坠的过程中大喊，话虽没说完，自己却消失在了悬崖之下。“啊——————！”Tdl大喊了一声，抽出长剑，将黑衣人狠狠的劈成了两段。他对着Elc掉下去的地方跪了下去，低下了头。Elc总是对的，但是因为自己的愚蠢和冲动，害死了Sr，如今又害死了他。他看着昏迷的Tco，想起了他父亲的话：“一切要你自己去领悟。”或许，这就是它的含义吧……他长剑拄地，低头，泪如雨下。他并不是一名合格的伦诺克斯，没能做好自己的职责，反而搭上了他亲友的性命。不知过了多久，天已经微微亮了，Tdl方才颤巍巍地站起身，跌跌撞撞地朝法师冲去……Tco已经睁开了眼，但他仍然很虚弱。“理智……！”Tco用沙哑的声音对Tdl说，但Tdl没有理会他。Tdl在前两米处跃起，双手持剑，凄厉地喊了一声，然后腾空转身，亮银的长剑在朝阳的照耀下画出一道耀眼的弧线……没有发出声音。整个山顶好像都静止了，Tdl看到了Tco憔悴无奈的脸，看到了法师血红的双眼，又仿佛看到了被浓厚云层汇聚的阳光，看到了山下沉睡的Elc，远在万米之外的格兰陵，金光闪耀的索科特拉，坐在塔顶欣赏风景的Sam，和他手上那只从不离开的小瓢虫……法师的手缓缓抬起，却丢下了手中的长剑和法杖，自己的剑以缓慢的速度向他的胸膛刺去……“天神之使降人间~伦诺克斯终身现~永世长存治盛世~来影去踪幻云边~”不知为何，他的脑海中浮现出了这首歌谣，仿佛它承载了他的记忆，讲述了人间真理一般……是啊，当年他梦开始的地方，Elc唱的就是这首歌。现在回想，这一整年，度年如天，仿佛从须弥到Sr的终点只过了一个夜晚，仿佛从弩门诺尔到欧瑞克殿只花了一个白天……猛然见，Tdl惊醒，他的长剑在法师的前胸砍出了一道月牙形的紫色伤口，而他手里的剑燃烧着熊熊的红色火焰。Tco欣慰的笑了。法师的黑袍随风飘散，烟尘散尽，一个有着淡色头发的人躺在草地上，他也被那道伤口伤得不轻，从伤口了流淌出一种梦幻般的烟尘。“Tco……”那人喃喃。“SdH！你怎么会这样！”“Tco，对不起……我没能经住诱惑……””看着我的眼睛……年轻的伦诺克斯，我能感到你流淌着的充满烈火的血液。看着我的眼睛……”SdH转过头，对Tdl说：“孩子，路还遥远，你亦如此。你要以我为鉴，相信我……”他猛地摇晃着Tdl的胳膊：“相信我，不要被感性所侵蚀……你有着无可比拟的能力和前路，你要把握住……驱散心中的暴雨，别忘了你的使命！把握住……以我为鉴……”随后，他就闭上了嘴，身体逐渐散成碎片，飞向空中，汇聚成了一颗星星，隐入了太阳的光辉……后来，不知过了多久，Tdl也忘了，Tco也忘了，Sam带着人马过来接应，Tco和Tdl躺在加宽的三匹马背上，醒来时，已经回到了M1037的床上。Tdl起床后急忙冲出了门，听到Elc已经被Sam等人埋葬，举行了简单的葬礼后方才放心。后来Tdl吃午饭时听Tco说自己仅仅用了3秒钟就KO了一名法师，并由衷为自己感到佩服时疑惑不已。“或许是那一瞬间你感到了可怜的SdH身上仅存的一点理智，并在他的引领下回望了自己的过去，感到了世间的美好。嗯，他的使命就是如此，对使命彻彻底底的信服是他恢复了理智。不过，他做到了，确确实实做到了。”当时，Tco是这么说的。终于，他彻底放弃了作为人类时的种种变强的欲望，终身成为一名伦诺克斯，尽自己的能力完成使命。此刻，他终于明白了自己父亲的话，和Sr临终前那言还未尽之意。 但是，SdH说的没错，他还年轻，还有很多路要走，因此他再次找到了Tco，和他请教经验。Tdl打开了Tco家的房门，里面一片黑暗，只有几根蜡烛和窗外的月光。Tco手里拿着一张羊皮纸，闭着眼睛。“Tco阁下？”Tdl轻声说。“噢，原来是你。坐下吧，要喝咖啡吗？”Tco搬来了一把皮椅。“呃，不必了。我刚喝了一整瓶水，别误会。”Tdl尴尬地笑了笑。没等Tdl继续开口，Tco反倒先说：“Tdl，你有没有想过法师众人的做法是正确与否？”“这……”Tdl一时被问住了。他貌似从来没有想过这个问题，而是一直按照着常人的想法，认为法师所做的都是错的。“其实法师所做的并不完全错。他受到星光的惩罚，完全是因为他受到了诱惑而丧失了信念。这种人是可耻的。但他的确也用自己的能力创造了他所认为的美好。”Tco睁开了眼睛，在黑屋里发出幽幽的蓝光，“那就是魔影。它的确满足了部分人的意愿——身体上的满足，而非精神上的。法师认为这是一举两得的办法，即巩固了自己的地位，也实现了使命。可他（们）的想法并没有得到所有人的认可，比如我的故友——MiluiAstor。”不知何故，说到这里Tco的眼角抽动了一下，“所以以MiluiAstor为首的一群人类、精灵和矮人结成了军队企图推翻法师的统治，奈何，失败了。我曾听闻法师的星光们有一部分曾是堕落魔神的下属，他们后来改写规整，但性格缺陷却保留了下来：会被利用以及崇尚满足。或许，埃努诺尔剥夺了他们的实体，就是对他们最好的惩罚吧。”Tco缓缓地说。Tdl想了想，点了点头。“可为什么他们在后来没有反思到问题呢？”Tdl摸着下巴。“显然，从小在贵族家长大的法师首领萨托罗对人性的了解并不完善。我猜以你的才智，理解这点不成问题。而且在豪门长大还有一个缺陷，就是对权力的极度渴望。唉……终究，聪明反被聪明误。”Tco拿起桌上的咖啡，抿了一口，苦得他连忙吐了出来。“看来这不是一次谈判就能解决的问题。可怜人呀……”Tdl感叹着，向Tco道别，回家睡觉了。这平凡的故事，却在第五天的一个夜晚，发生了转变。 “报告Sam大人，有一个名叫MaegAstor的小子说要见Tco大人。”“哦？见Tco大人？打发他走吧，大人没空理闲人。”Sam懒洋洋地说了一句。一个声音打断了他喝酒：“Sam！我都说了多少遍！让他进来，我要和他面谈。”Sam听后连忙起身，向Tco行礼：“长官，我知错了，马上就去。” XI November·ASEXEED此时此刻，在遥远的南方，古老的艾萨克德的一个小村子里，一个身披山羊皮斗篷的军官摸样的人骑马走到了克林顿镇的一个湖泊边。此时正值凛冬，湖面早已结冰，在湖边矗立着一个黑色身影，双脚踩在两拃厚的雪地里，手里拿着一个发光的东西。军官模样的人悄悄走近，只见那男孩手里的，是一块镶嵌着紫水晶的岩石，紫水晶不知何故，发出幽幽的紫光，飘忽不定。“斯诺家的孩子，把那东西给我。”军官下了吗，凑到了男孩身前。男孩吓了一跳，他连忙把石块揣进怀里，向后退了几步。军官没有上前，他摘下了帽子，露出了一张年轻但算不上英俊的脸。“斯诺家的孩子，November，我知道你的名字。不要对我有敌意，我是安德森王亲卫队的队长Jerald，我不会对王国子民做出伤天害理之事。”“你休想骗我。”男孩继续后退。杰拉德抬起头，从自己怀里掏出了一张金箔，上面用黑墨水写着几个字：安德森第27任亲卫队队长——Jerald·K·Stalos。“现在你能相信我了吗？”“男孩有些迟疑地点了点头。“失礼了，但是奉国王的命令，请你跟我走一趟。”待到November再次离开自己那匹黑马时，他已经来到了千里之外的欧瑞克。 安德森，欧瑞克殿。“萨托罗，跟我说实话，你到底做了什么。”安德森王用威严的声音对此刻站在金碧辉煌的宫殿阴影中的法师之首说。“陛下，如您所愿，我已经使您的子民完全听信与您并且感受到美好了。”法师用嘶哑的嗓音回答。“如我所愿？可为什么仍有人奋起反抗！”安德森王冰冷地问。“陛下，我猜想这可能是魔影减弱的缘故……”“那就加大魔影的范围和力度。照我说的做。”“可施展魔影本就需要极大的法力加持，而我们又在苏鲁雅特失去了一个同伴，现在恐怕难以维持……”“照我说的做，你忘了我们的约定了吗？事成之后，我会让你的到你要的地位。”安德森王没有丝毫怜悯。“可是这会对我们的精神造成不可磨灭的伤害……”法师无力地反抗着。“照我说的做，加倍赏赐你还不够吗？”“遵命，陛下。”法师垂下了脑袋，离开了大殿。” 此刻大殿外寒风凛冽，November浑身早已冻僵，鼻子和睫毛上都挂上了细小的冰晶，可Jerald仍然没有回来。他不仅开始怀疑起来，Jerald真的是想带他来见国王吗？再这么下去，怕是没见国王，自己反倒现冻死了。正在他忧虑之际，Jerald的声音传了出来：“遵旨，November，你可以进来了，陛下召见您。”November迈着沉重酸痛的双腿一步一步上了台阶，缓缓走进了温暖的大殿，大殿内金碧辉煌，装饰着古代传说所绘的黄金壁画。大殿正中央有一个长方形大理石台子，台子上坐在铁王座上的是一个看起来年过半百的老人，但王者气息犹存。想必他就是国王。“在下November·Snow，参见安德森王。”“孩子，你来了。我想你在外面已经等了很长时间，对此我深表惭愧。那我就不废话了。我听说你有一块奇特的宝石，拥有看破一切的能力。它对我来说异常重要，能否将它送给我？”“是啊，可他毕竟是我们家的传家宝啊。陛下。”November看着旁边Jerald的表情，连忙补上一句。“我理解。但是能否借于我几日？”安德森王威严的说。“可陛下希望用它来做什么？我们家族有规定，心术不正之人不可玷污其高贵的本质。”November缓缓地说，没想旁边的Jerald却突然大喝：“大胆！你这是在说吾皇心术不正吗？拖下去！”“住手！”安德森王平静的命令打断了几名卫士的动作。“我拿它做什么，与你无关，也请你不要多问，这不是你能知道的。”“那么陛下，我非常遗憾的告诉您，我无法向您提供它。”November缓缓说道，安德森王的胡须微微颤抖，但他还是很平静地说：“孩子，我真的很需要他，请你把它给我吧，我以我的名誉发誓，我不会拿它做不正当的事。”“可是陛下，这世上有如此多人说自己发誓，他们都信守承诺了吗？不，他们没有。”November刚说完就后悔了，但他听见安德森王说：“我了解，毕竟这对于你来说十分珍贵。但我身为一国之君，难道你都不能放下戒心吗？”“抱歉，在没有充足的佐证情况下，我不能擅自做决定。”他没有后悔，但是他感到一阵不安……因为他听见安德森王那冰冷的语气：“何以至此！孩子，我的耐心正在燃烧……快给我吧，相信我！”他没有行动，但是身后的Jerald却动了起来。November反应迅速，他摸向自己的腰间，却只摸到了腰带和空无一物的挂钩。他的那把剑早已在启程的时候就被Jerald没收了。心机，太心机了，他想，随机一脚揣在一名守卫的肚子上，上前两步前置住另外几位，然后劈手砍在那名守卫的手腕上，夺过他的剑，随即在身前挥了一条弧线逼开了另外几名守卫的剑。正当他准备逃出大殿时，Jerald突然出现在了他的身后，手里拿着一柄弩。“放下武器，束手就擒。”Jerald扬起下巴，露出了胜利般的微笑。“小子，身手不错，只可惜太年轻了。”November静静地坐在一间冷的要命还透风的木头屋子里，从仅有的一扇小玻璃窗户里看着外面的鹅毛大雪，还有灯火通明的宫殿。木屋的门被紧锁着，他在里面出不去，也不想出去。他刚刚才夺来的那把剑也被折断了，现在他除了身上的衣服和影子山猫斗篷，一无所有。门传来了开锁的声音，被从外面打开了，Jerald站在外面。“对不起，让你受苦了。那石块我不会交给国王的，你自己收着吧。”Jerald低声说。“可是你怎么办？没拿到原石，安德森王陛下不会让你好受的。”“无妨，我就说你宁死不屈。毕竟这世上也不止一块原石，大不了把你放还故乡，也不会有什么大事发生。但是你在宫殿里说的话……”Jerald摘下了帽子。“是啊，我一个乡下人，说话没大没小的。早知道我就忍忍了，奈何死性不改。”November摇了摇头。“算了，回头我跟国王替你求求情吧，这个给你，别冻着。”Jerald递来两件里面镶着毛皮的衬衫和皮质的裤子，笑了笑：“活着，比怎么都好。”Jerald走后，November才低头看向自己的胳膊：在宫殿了Jerald错放的那一箭，不偏不倚的擦过了他的左臂。弩箭可不是普通的箭，威力可大的多。好在没伤到持剑的右臂，他还能自卫。想必Jerald也为这件事付出了代价，不然凭他高傲的性格在怎么说也不会对他这么好。不过November却在他身上体会到了长兄的亲切，他上一次体会到已经是十年前了。他默默地笑了。他从地上的木柴堆里取出一根又细又长的木条，练起了剑术。他的剑术师从曾经文明天下的剑术大师Thesues，有着不输其师傅的技术。但是后来Thesues因为反抗安德森王受到追捕，从此失踪了。他想到这里突然一股怒气上身，猛地一抖，木头刺到了床上的几根铺垫的树枝，树枝被齐齐的斩断。他方才感到赶了好几天路，自己已经疲惫不堪，于是盖着山猫皮斗篷，沉沉地睡去了。 XII Thesues远在万里之外，正处于亚热带气候温暖的乌顿格兰陵地区，索科特拉堡垒内正在进行着激烈的训练。“对，非常好，剑法一式——艾塔加。”Thesues停止了动作。“他是最基本的剑术，也是这周你要攻克的一部分。别说我难为你，当年你的师兄——虽然他比你小一点——November只花了3个月就学完了所有剑法，而一式他花了一周半就已经能和我对决了。加油吧！”Tdl甩了甩脑袋上的汗水，再次调整了握剑的姿势。自从上次他解救Elc时表现出的糟糕剑法，Tco就让他和传说中的大师Thesues学习。学习剑法固然难，但对于胡乱击剑击了四五年的Tdl来说更是雪上加霜。Thesues说他不得不从最基本的开始，调整自己的习惯。此时Thesues已经让他的助手走了过来：他曾说过，一式剑法常用于一打多人，但是缺乏准确的攻击目标，因此需要多人共同训练。眼见两人的剑朝Tdl扑了过来，Tdl连忙举剑格挡，但是一着急，刚才Thesues所辅助的招式全都忘光了，胡乱的挥了几下，手中的木剑却早已被挑飞到远处。“不要着急，慢慢练。你太心急了。记住，要用心感觉对手的方位，感受对手的情绪，预判对手的动作，这样伺机而入，自然可以击败对手。所有的剑式只是表现形式，而内涵是一样的。好好练练吧，摆好心态。”Thesues说。“天色也不早了，咱回去吧。”Thesues的助手说。于是Thesues带着助手离开了，远处的茫茫原野衬着一抹夕阳，照亮了索科特拉的大门，猛然晃过了一个金色的人影，威严而高大，仿佛在哪里见过。他想自己也许是累了，于是踉踉跄跄地走回了堡垒。此刻，Sam正在往索科特拉大门走的路上，他手里提着一块照明石，摇摇摆摆地往前走。索科特拉的大门已经近在眼前，他加快步伐小跑了过去，给外面的MaegAstor打开了门。“您好，想必您就是Tco大人吧？”对方问，伸出了一只带着皮手套的手。“呃……这个……”Sam支支吾吾地说，在思考到底是应该给自己的形象加分还是给Tco的形象减分。“胖子走开，”还没等Sam说完，一个身穿黑色皮衣，留着卷曲黑发的人就用剑柄推开了他，“见到你很高兴，我是索科特拉堡垒的守望者队长Thesues，这位是守望者队员兼这里的钥匙保管员Sam先生。我想你会在堡垒的地下一层找到Tco大人的，需要带路吗？”emmmm……那就太感谢了。“MaegAstor连声道谢。Thesues带着MaegAstor来到了山腰处，绕过了荆棘丛，穿过石拱门又猫腰钻过藤蔓四处的篱笆，终于看到了堡垒并不起眼的用扁平石料堆砌成的小门。进了大门，Sam拉了Thesues一把，Thesues心领神会，说了一句：“请慢走”就闪身躲进了旁边的阴影中，消失了，只剩下在闪闪烛火中茫然而不知所措的MaegAstor。“恭候多时，你是来找我的吗？”一个黑影缓缓从阴影了走出，这使MaegAstor回想起了那段不好的记忆……“别害怕，我不是BalchCrist，也不是他的同胞。”一个穿着斗篷，看起来很长时间没梳理导致头发纠结在一块的十分沧桑缓缓从阴影里走了出来。“我叫Tco，就是你要找的人。”“可是你怎么知道……”“我是伦诺克斯，咱们能够互相心灵感应。你想寻求我的帮助？我这里恰巧也有另一个有着同样想法的人，我觉得，你们可以一起寻找自己。”Tco甩了甩手，“他在后院，应该也快回来了。”“可是我……”“我明白。有些事，是要自己领悟才能发挥出最大价值的。”Tco说着就再次步入了黑暗之中。 “我总觉得你有点不对劲？”Thesues和Tdl走到了要塞外的蕨类丛中，坐在了一块岩石上。“嗯。是这样的。我想回去看看你的师兄……我的……我的弟弟。”Thesues抬头望着天上的明月，然而月亮似乎愈发昏暗。“今天是八月十五，在东方的习俗里，可以透过月亮看见自己的家人。”“November是你弟弟？”Tdl饶有兴趣。“是的……或者说，同父异母的弟弟。”Thesues苦笑着，“我们都不知道对方的存在，直到我看到了他的眼睛。特有的紫红色。”“你的父亲是谁？”“我不知道。我唯一的记忆，是他有一双紫红色的眼睛，我也是。”“可你知道他住在哪吗？”Tdl问。“或许吧。大概在艾萨克德那里。明天我就启程，麻烦你去跟Tco汇报一下。路途遥远，就算我骑飞兽也要小半个月。你别忘了复习剑法，回来我会和你过过招。”Thesues回答。Tdl望着Thesues略显俊俏的脸，发现他的眼睛确实与众不同，是一双紫红色的眼睛。“就是这样的。”Tdl对刚准备睡觉的Tco说，“Thesues想要去找他弟弟。”“vocal,这小子也太能装了，我从来都不知道他有弟弟！想出去旅行用不着这么装啊。”Tco嘟囔了几句。“我看他是真的。”Tdl说。“而且他现在已经准备了，你怎么看？”“没什么看法。他走了，你就先被任命为守望者队长了。具体的，你只需要每天在那个瞭望塔上站着。我想你的视力应该不错。至于Theseus，他迟早会回来的，不必担心安德森的危险。”“什么危险？”“魔影，我感到那个东西又变强了。但这也是双刃剑，法师知道这么做肯定会吃不消，所以每次想到这事，我都为安德森王老头子捏把汗。”Tco说，“他怎么想的，敢用法师这么不正经的人做宰相？”“我害怕的是法师发兵。”Tdl说。“法师肯定不会擅自发兵。经过前两次的失败，他对你的提防更进一步，不敢轻举妄动。然而，他始终想要杀你，不要侥幸。我说过的，你与众不同。”Tco说，“而且我再说一遍，我困了，有什么事明天再说也不迟。”“容我再问一个问题。”Tdl说，Tco躺下，点了点头。“紫红色的眼睛意味着什么？”Tco怔住了，他缓缓地坐起，然后闭上了眼睛：“我的天啊，我真是糊涂了……紫红色的……我怎么没注意到……不……Tdl，这个问题容我思考一下，拜拜。”深夜中，Thesues站在山峰顶部，说出了他一直不敢说的几个字：“王的土地，有希望了。”次天清晨，一个村民跑到了要塞门口。“快，我要找Thesues！”他的看门的Sam说。“Thesues昨晚刚走了。”Sam摸了摸下巴，“你要是找守望者队长，就去找Tdl吧。正好他和Tco关系不错。算了，我去找他，你先在这里坐一会，有事慢慢说。”村民坐了下来，注意到了面前的一瓶绿色饮料，上面还装点着一根香菜。村民从一公里外飞奔过来，此时已经饥渴难耐，于是想都没想喝了几口这不知名的饮料。渐渐的，他开始感到昏沉。“啊，多么一种诡异的饮料。像是葡萄，柠檬和木瓜味道的混合。”他想。他感到他开始做梦，梦见一座巨型的，晶莹剔透的村庄正在他的前方，而他自己，就是这片土地的建造者，也是它的王。这时，村民看见了Sam，他带着一个年轻人。“你找我什么事？”Tdl问他，村民突然感觉自己像是犯了错，而面前的人是如此的高大而威严。“不不不，请别再让我受苦了！我错了，抱歉！这只是一场误会！”村民看见了Tdl腰间的长剑。Tdl楞了一下，问：“你怎么错了？”然而村民却认为Tdl在质问他，连忙说：“不，您都知道了，但……别这样！求您了，这不是我的错！那是Mallos的问题！放过我吧！”最后一声大喊变成了尖叫，然后村民失魂落魄的跑了出去。“他是怎么了？”Sam问。“不知道，可能是喝醉了，或者做噩梦了吧。”Tdl回答。“Mallos是谁？”Sam问。“我听说过，好像是个北方的将军。他做错了什么呢？” XIII Fortress Library“Tdl，你看见我的那瓶Tourist药水了吗？”Sam突然问Tdl。“没有啊，”Tdl回答。“那是什么药水？”“Tourist，致幻药水，我本来打算用它来喂掠夺兽的。最近我养的掠夺兽看起来心情不好。那是一种淡绿色的饮料，我放在一个玻璃瓶里。”“玻璃瓶？我只看见了一个空的，里面确实有淡淡的绿色，但已经所剩无几了。”Tdl叫住了Sam。“哦天啊！它被谁喝了？不，我想是那个村民！快去追他，他一定是说梦话了。我想他有什么事要跟你说！”Sam后知后觉，拉着Tdl往门口走，这时，Tco闪了过来，挡住了去路。“不必去追了。”Tco说。“你不是去处理掠夺者和村民的纷争了吗？”Sam有些疑惑。“哦，我到的时候一个叫Dream的村民大佬已经处理结束了。很难想象，他先是把掠夺者们引导了岩浆里，然后使出古希腊不传之秘——岩浆落地船成功逃脱。可怜的掠夺者们都si了，这不是我想要的结果。当然，我知道你们再找的消息。那个村民失魂落魄的跑来时，跟我说了情况。他好像有点不正常。”“没错，他误喝了我的致幻药水。”Sam惋惜地说。“可是消息是什么？”Tdl追问。“法师带领军队冲破了萨鲁曼德的 White River 。这不是好消息，我没想到法师竟然孤注一掷。显然，这是缓兵之计，他们一定有重要的事需要拖延。Sam，你去忙你自己的事吧，Tdl，跟我来一趟。”Tco表情严峻。Tdl惶惶然跟着Tco来到了要塞深处的一间小隔间。“你还记得你之前问我的问题吗？紫色的眼睛？”Tco四处望了望，见四顾无人，缓缓地说道。“当然，你搞明白了？”Tdl立刻来了兴致。“不，但我相信很快会的。咱们需要去一趟要塞图书馆。”Tco拍了拍Tdl的肩膀。“这里不是也有藏书阁么？”Tdl有些疑惑。“我找遍了，但那时远古时期的传说，早已失传了。只有要塞图书馆才记载着那段历史。”Tco摇了摇头，“而你，是唯一能够打开要塞之门的人。别问为什么。”听到Tco的话，Tdl欲言又止。Tco拉动了不知从哪里来的一个拉杆，一扇暗门缓缓打开。Tdl在Tco的指引下进入了一辆矿车，然后又拉了一次拉杆。随着暗门的关闭，四周陷入了一片昏暗。“Tco？”Tdl轻声叫道。“小声点。现在咱们在矿洞里，很难想象会有什么奇异的危险。大概一个小时后才能到。耐心点。”Tco说。Tdl在深暗狭窄的环境里很不适应，但是很快也平静下来，静静地等着旅途结束。无聊的时候，Tdl就习惯去关注一下周围。现在在地下他已经呆了5分钟，渐渐适应了幽暗的氛围。更何况有时石头上会长一些发光的苔藓，这让Tdl稍稍放心了些。“这不会很恐怖的。”他想。但是很快，Tdl发现了四周环境的一些变化，原来暗灰色的岩石变成了诡异的深蓝和白色，时不时还有微弱的嗥鸣四散空中。诡异，难以置信的压迫感再次令Tdl喘不过气来。但是他能做的，只有等待。“Tco？”Tdl又叫了一声，但是Tco比了一个安静的手势。“小声点！”Tco在耳边轻声说。“这条路我还没走过，但是可以肯定，这里是深暗之域。民间常说这里有生物会循着声音来攻击你，如果你不想死的话，就别说话。”Tdl点点头，尽管他知道Tco看不见，然后不上嘴，等待。洞穴渐渐开阔了起来，愈发暗淡。那些发光的地衣不见了，取而代之的是一种Tdl没见过的东西，长相诡异，像是一个苍白的微型火山口，不仅散发着诡异的蓝光，还时而发出诡异的怪叫，令人毛骨悚然。“duang~”矿车停了下来，Tdl以为到了地方，但四周仍是一样的岩壁，毫无变化。“这边走，还有一点徒步路程。”Tco低声说，“放轻脚步！”Tdl小心翼翼地跟着Tco来到了一个洞穴入口。在狭窄的洞穴里，Tdl猛地被什么东西扎了一下，胳膊上流出了鲜血。但神奇的是，很快就愈合了。Tdl最终发现，扎他的是一种飞行生物，它们有着淡蓝绿色的外形，浑身散发着光辉。“是悦灵，”Tco说，”太棒了，它可以跟着我们，帮我们照明。”洞穴不长，很快就到了尽头。Tco掏出一根木棍，敲了敲石板，毫无反应。“Aodutrn-Sirdian！”Tco用精灵语念了一遍不知名咒语，Tdl竟然听懂了，他说的是：“幽暗领主，有客人来见！”石板已经没有打开，但上面闪出了一段符文，按照Tdl的理解，写的是：请说朋友 然后开门。Tco显然熟读指环王，他流利地用精灵语说出了：“Mello（朋友）”。话音刚落，石门随之打开。豁然开朗，Tdl进入了一个由幽蓝色和乳白色岩石构成的地下世界，远处依稀还有远古的雕像，神秘莫测。Tdl发现了一种植物，它会自动摆动，而且踩上去后还会发光。不过他再也没有机会这样做了，因为Tco拉着他走下崎岖的岩壁，来到了一栋一层式的巨大建筑前。“来吧，Tdl。鼓起勇气，你知道该怎么做。”Tco拍了拍Tdl后背。Tdl愣了一下，刚想询问方法，但他脑海里却猛然间闪过了一个不知来自哪里的画面。没错，这就是答案。Tdl走上前，抽出了自己的长剑。Tdl闭了闭眼，然后用剑隔开了自己的左手手臂。鲜血洒在了木门上，门消失了。Tdl仿佛是天生先知一般，带着Tco绕了两圈，竟然误打误撞地真的找到了图书室，开始寻找。然而Tdl没有注意到，他手臂上残余的一滴血，掉到了一处深蓝色的诡异岩石上，岩石上的不知名植物类物体颤动了一下，惊醒了门外远处阴暗角落里的一尊雕像。 “快，快找找，看书脊就行。”Tdl说，他和Tco一本一本地查找着，仍没有一丝头绪。“别着急，慢慢的，记得留意那些和王室相关的书。”Tco说。“Wtf，到底在哪里！我感觉这图书馆都要被找遍了！”Tdl愈发着急，气恼地把一本大部头的奥德赛历史扔在了地上。“别这样！”Tco大喊，“会引来危险的！”已经晚了。要塞图书馆的天花板和一侧墙壁被一股巨大的力量撞成碎片，两条散发着诡异蓝光的巨大物体从天而降，和Tco的鼻子擦肩而过。“快出去，Tdl！拿上那本历史书！”Tco竭力大喊，然后拔出了长剑。霎时，昏暗的地下被剑身周围的火焰照亮，那巨型生物也停止了攻击。随后，一声刺耳的嗥鸣响彻地底，Tdl只觉得两眼一黑，索性在Tco的搀扶下勉强没有摔倒。后来，除了进入矿车途中的一路狂奔和回到索科特拉后的熟悉的变色火把以及房间里的柔软的床，其余的事情Tdl什么也没记住。至于那本世界历史，也消失得无影无踪。而躲在墙角的FaH，恰好目睹了这一切的发生。等到FaH看见Tco离开之后，他悄悄地来到了那个暗室里，然而却没办法打开石门。这时，那只悦灵飞了过来，手里还拿着一只红色的拉杆。“啊，悦灵！你竟然在这里。谢谢你的帮助！”FaH十分欣喜，用拉杆打开了石门。石门内部漆黑一片，FaH靠着在乌顿与UmDraug激战是积累的经验，轻松地找到了矿车的位置。他顺着矿车铁轨而下，消失在了黑暗之中。 XIV Twilight of WarTheseus在风袭平原上奔跑。这里的环境早已大变，杂草丛生乔木枯萎，不禁让人想起了遥远的厄雷龙之岛（别急，我之后会告诉你它是什么）。那地方Theseus也只在小时候随父亲拜师学剑的时候在海上遥望过，但那里巍峨的火山和炎热的气温却给Theseus留下了深刻的印象。传说那里有着不为人知的其他蛮荒种族，但眼下最大的威胁显然不是他们。Theseus不清楚他是否真的有个弟弟，但紫红色的眼睛确实是独一无二的。当时他跟Tdl撒了谎，他儿时从未见过自己的弟弟，这只是他的推测罢了。他见到的紫红色眼睛不过是父亲的眼睛罢了，然而无论怎样，November都将会是他如今唯一的亲人。他的父亲在早些时候加入了反对魔影的组织，后来计划的失误导致整个组织遭到了屠sha。不管怎么样，眼下的事情无非是干路，然后找个村落好好休整一下。希望这一路别出什么岔子，否则他就失去了走出这片荒芜之地的唯一机会。这里太荒凉了，马吃不饱，人也难以振奋。Theseus犯了个大错，他只带了地图而没带望远镜，这意味着能否找到村落全屏运气，弄不好还会绕很长的路。然而事实证明Theseus得到了幸运女神的眷顾。他毫无头绪，索性催马直奔了好几英里。万万没想到他竟然歪打正着真的瞧见了一座高大的城池。这一定是霍华德城，这说明他离安德森不远了。找到了安德森的方位到时候Theseus就可以定位艾萨克德了。他又催马直奔，来到了城门之下。“你是什么人，报上姓名！”城头守卫大喊。“吾乃Oren之子Theseus，前往安德森路过此地！”Theseus道。城门守卫朝身后的人低估了几句，大喊了一声“准放行！”Theseus没想到事情如此顺利，他想也没想就前行入城。突然他犹豫了一下，眼角余光瞥见了一支飞箭。他下意识俯身躲过了致命伤害，但箭仍结结实实地刺中了他的左肩。Theseus哼一声，翻身下马。城门轰地一声关闭，十数名守卫转瞬间来到了Theseus身前。“Theseus，真是个好名字，可惜从今天开始，你的头将化作100枚金币，流入我们的口袋！”一名守卫笑道。“安德森王下令逮捕你不过7天，你就子找上门了！”另一名守卫大笑。7天？怎么可能……他出发不过两个星期，消息传得这么快吗？还有，安德森的那帮人怎么会逮捕他？Theseus暗想，右手下意识地拔出了长剑。“怎么？笼中鸟还想啄人不成？”一个穿着黑衣黑甲的守卫首领啐了一口。Theseus没有说话，他默默地把长剑举向身前，换成了更加灵活的右手持剑，等待着对方行动。随着守卫也把武器拿出，那名戏称他为金币的守卫首先冲了过来。Theseus一眼看出，这人虽然看着孔武有力，实则挥剑没有章法，反而有着固定节奏。于是他象征性地格挡了几下，然后故意让自己慢了半拍使对手的剑随着惯性回到身侧，然后旋即转手挥剑破了对方的臆想。紧接着又有三个人朝Theseus冲来，Theseus用环绕的方式牵制了第一名对手的重心，然后接着余力隔开了第二人的短刀，最后和第三个守卫的攻击擦肩而过，顺着他的剑刃直逼虎口，血流如注。趁着Theseus喘息的间隙，另外两人的剑已经朝Theseus刺了过来，于是Theseus后退了半步，任由剑刃架在脖颈，然后猛然用尽力气将自己的剑以战锤般的攻击线路砸向二人最脆弱的弱点——没有保护的脚踝。两人应声倒地，无力作战。但守卫并没有给Theseus喘息的机会，黑甲首领一声令下，其余七名守卫一起朝Theseus重来，浓重的尘埃淹没了几人模糊的身影，只留下刀剑相击的脆响和刺穿铁甲的摩擦…… FaH 继续在隧道中乘着矿车奔驰而下，一种不得而知的恐惧油然而生。他闭上眼睛，幻想着这里是一个温暖的河边。可没等他享受多长时间夕阳余晖的抚摸，残阳就落了下去。在黑暗中，那片温暖的河岸也变了一番摸样。不知何时河岸上多出了几根白骨和断裂的长枪。一颗头盔斜插在一柄剑上，原本随处可见的螃蟹也都消失不见，取而代之的是——零零碎碎散落在地的箭矢和……那是什么？是血迹吗？尽管经历过那场与恶狼的会战，但是FaH不曾像他的矮人导师那样英勇。他连忙睁开眼，但是眼前的只有另一片昏暗。不过他这下可不敢再闭眼了，索性直接瘫坐在矿车里发呆。四周响起了奇怪的敲打声，但是他不敢扭头，只能靠想象Tdl和Tco来过的画面安慰自己。经过不知多长时间的煎熬，他终于停了下来。他身处黑暗，只能摸黑行走，一步、一步，咔嚓一声，他的脚似乎提到了什么东西。好像是火把，又像是什么石块。FaH满怀欣喜，他俯下身去，顺着声音的来源摸索过去，但只摸到了一块冰冷的石头。“shift！”他嘴里骂了一句，随手就扔下了石头。没想到石头落地之后，脚下一片闪光。他感觉有些不对劲，于是又把他块闪光的石头捡了起来，原本冰冷地石块却散发出一丝熟悉的温暖。“啊，是磷石啊。不错，差点把好东西弄丢了。”FaH独自感叹。他拿着磷石搓了几下，果然更加善良的蓝光迸发了出来。借着这光，FaH快步向前走了几步，走到了一处洞窟前面。想必他们要找的东西就在这里了。FaH进入洞穴，洞穴很窄，FaH干练的体型尚且离墙壁不足二十公分，一股潮湿的发霉味扑面而来。FaH屏住呼吸快走几步，来到了那扇半关着的木门前。他使劲一推，门彻底打开，里面是一个庞大的洞穴体系——不对，不仅仅是洞穴，而是一整个城池！在磷石的照耀下，火光映不出的轮廓逐渐清晰，一座古老而锈迹斑斑的古城赫然出现在了FaH面前，而最引人注目的，则是那座大部分由木制制成，与周围环境格格不入的——藏书阁？FaH缓缓走向前，看了看木门旁边的标签。没错，是藏书阁，里面甚至还留有火烧焦木头的淡淡气味。这一定就是他们来的地方，FaH想。进入藏书阁，FaH才发现原本高达瑰丽的藏书阁已经被摧毁了一般，几乎倒塌。他借着磷石的幽光，注意到一本散落在地面的精装大部头书，标题是：$\\texttt{Outerside Chronicle}$ （奥德赛编年史-中文翻译），这上面有明显被翻动的痕迹，于是他轻轻拿起它，藏在了衬衫里。突然，远处传来了微弱的说话声，FaH立刻警觉了起来，他蹑手蹑脚地跑出藏书阁，快速钻进了洞穴。临走，他向后一瞥，似乎看见了几个黑影……四目相对，FaH冷汗直冒，惊恐的爬进矿车，开始了归途。 此时此刻，在索科特拉的地下一层，Tco将Tdl带到了一个隐秘的会议室。里面Ofd已经落座。Tdl环顾四周。这是一个宽大的石质房间，地板和天花板则由橡木制成，散发着清香。天花板上一圈刻出了凹槽，里面发着淡黄色的光，似乎是神奇的荧光物质，给人舒适的心情。壁炉里面火花噼啪作响，一切都那么安静、祥和。Tdl愈来愈喜欢索科特拉了。“好久不见啊，Ofd。你最近还好？”Tco率先发话。“挺不错，要不是您那位高徒非要千里迢迢去找您的话。”Ofd仍然像Tdl记忆中最后一刻那样尖酸刻薄。“我今天来是要说一件事，希望这里不会隔墙有耳。”Tco皎洁地笑了一下。“有关于Theseus和他的徒弟的事。”“你是指他的眼睛？”Ofd观察力还是够的。“这只是线索，我在想他们是不是真兄弟。”“那怎么可能。他们在一起生活多年，怎么可能互不相认？”Ofd不假思索。“我觉得是真的。他那天在瞭望塔上跟我透露了一些。”Tdl插嘴。Tco摸了摸下巴：“嗯，我在思考紫红色的眼睛到底常不常见。”“这件事我真的有所耳闻，”Ofd调整了一下坐姿，离另外两人都近了一点：“紫红色眼睛只可能是艾德蒙家族的人。他们家族早就销声匿迹了，但是后代四散五洲，不过目前活下来的应该不多了。”“但我仍然不认为他们是亲兄弟。这太巧合了。”Ofd继续说。“不……不是那么回事。我有预感。”Tdl缓缓说，他掏出了那枚金色徽章，上面浮现出了一张狂野、奔放、不羁而又亲和的脸。 黎明时分，November缓缓醒来。窗外的积雪融了大半，想必也是过去一天多了。他在草垛上躺着，发呆多时，Jerald才姗姗来迟。“安德森王为什么不派人搜身我？”November说出了心底的疑惑，但Jerald并没有答话。他从口袋里掏出了一柄小刀，又从腰间拔出一根钥匙，一言不发地递给了November，然后低着脑袋缓缓离去。November察觉到了Jerald的异样，他试图叫住Jerald，但Jerald只是回头看了一眼，然后再次一言不发地回头离开。Jerald眼里闪过的失望和无奈让November不安起来。November拿起物品，打开了自己随身携带的软羊皮包袱。但是看着空无一物的包袱，他一阵恍惚……那块紫晶圆石，消失了。November一时惊得说不出话，他颤颤巍巍地把小刀别进腰，钥匙放进包袱，然后抓起影子山猫斗篷披在身上，踉踉跄跄地爬出了Jerald给他留的门缝。他心里清楚一定是Jerald，但他不能怪他，因为他知道这只是安德森王的指示。或者说……这是Jerald的真实意图？November不敢往下多想，他强撑着寒冷和仍然没有完全恢复的身躯沿着记忆中的路途往回走。他要回到艾萨克德的家，但他也不知道他回家干什么……这算是一种执念吧。November走了不久就坐了下来，并不是因为劳累，而是因为不知道往哪里走。于是他又开始想Jerald的事。他突然想起来Jerald刚才还给了他一把钥匙。心中正疑惑，手打开了包袱，拿出了那柄黄铜制成的钥匙。November盯着它仔细看了看，发现上面画着一个蛇形符号。他记得小时候父亲似乎讲过一个关于伦诺克斯的故事，他们的符号似乎就是这样的蛇。但是伦诺克斯和这个钥匙又有什么关系呢？他们可是传说中的救世者，为什么这个符号会出现在一个平平无奇的皇家侍卫队长身上？面对心中更大的疑惑，November决定原路返回，在欧瑞尔周围探探究竟。既然心里这么想了，腿也就不由自主地站起来了。November再次披上山羊斗篷，朝着新的方向走去。 XV A Simple MemoriesFaH 终于望见了灯光，他急忙加快了踩矿车的速度，似乎生怕背后的黑暗吞噬掉他。随着矿车停止，双脚一落地FaH就跑到了拉杆前面。他回头看了一眼后面的隧道，转头闭上眼睛，拉动了拉杆。“咔哒“一声，石门徐徐开启。FaH等待自己的眼睛适应了亮光，然后他环顾四周，轻轻的拉动拉杆关闭了石门。他闪身躲到柱子后面，恰逢一名守望者走过来听见了动静。好在守望者只是喝了一口手里的须弥蓝酿，没太在意奇怪的响声。FaH快步走过索科特拉要塞七万八绕的走廊，经过若干次的迷路后进入了要塞的大厅中。然后他就不知道要去哪里了。Tdl和Tco早就不知道去了哪里，而且近几天内他也没有一个正经的容身之所，每天晚上只能谁在外面的草地上。不过FaH并不介意，他喜爱与自然作伴，想必是Faras的耳濡目染所致。但眼下，他要找一个隐蔽的地方看看大名鼎鼎的伦诺克斯Tco要找的书。他略微思索，觉得来时的那个走廊是个好去处。正当FaH四处游荡寻找走廊的时候，几天消失不见（当然只是FaH没看见）的Sam突然出现。“FaH是你吗？”FaH吓了一跳，他连忙转头看见了进来的胖子。他刚想开口问，就被Sam打断了。“Tco现在有事，他……呃几天前嘱咐我带你去你暂时的居所。当然，看我这记性，我把这事给忘了。”Sam不好意思地挠了挠头。FaH正苦于没地方看书呢！于是他跟着Sam的指引下到了负一层。“我瞧瞧……M1035、1036”Sam一边走一边数着负一层走廊上的门牌号，“不错，你现在可以定居在这里了。M1037，这是你的钥匙。”FaH接过钥匙，叫住了正要走开的Sam：“等一下，你能和我进一下房间吗，我想问……和你谈谈。”Sam站了一会，点了点头。 “好了，我想问问你，”FaH终于说出了心底的疑惑，“你记得MiluiAstor吗？”Sam喝了一口FaH倒的蓝酿，擦了擦嘴：“你怎么知道的。我一直以为这世上只有Tco知道。”“我是他的儿子。我进入过他的记忆。”FaH心头一阵紧。Sam似乎对此并不吃惊。“是的，太久远了，久远到我都记不清了。我还记得那次演讲，那时我只有十三岁。你父亲是个完美的领导者，激情的演说家，他让我们每个反抗魔影的人热血沸腾。“但是我再也没见过他。”“那你还记得SadronHathol，那个精灵吗？”FaH的眼泪无可阻挡得流了出来，他强忍心中酸意，继续问道。“当然，我还询问他MiluiAstor去哪了，但是他再也没有回应过我，任何一个词。”Sam见眼前这个年轻人真心相对，决定继续说下去。“后来，反抗军群龙无首，对抗魔影的战争屡战屡败，SadronHathol决定分队开展游击战术，而我被派遣将MiluiAstor仅存的幼子、他的继承人送去和他的遗嘱给乌顿地区的一个矮人，说是老相识。我就照办了，想不到现在还能再见到你。”Sam仔细端详了一会FaH的脸。“不错，确实锐利。”“然后我就继续回到SadronHathol的作战部队中，然而过了不到半年，那些法师却突然消失了，SadronHathol似乎如释重负。他为这场事业付出了太多，回报却太少，于是他将反抗军解散了，自己也回归了须弥老家，回归了那里的森林部落。“你肯定想知道为什么MiluiAstor的徽标是一只冰原雪狼，对吗？其实那都是为了纪念他的兄弟SadronHathol，SadronHathol喜爱狼。他就是骑着狼回到的须弥，从此须弥就多了一个传说：狼之主。“至于你的父亲MiluiAstor，他在森林中失踪了，反抗军多次想曾派人去寻找，但都被SadronHathol否决了。他说MiluiAstor不在了，但是我却亲眼见过他。我看见过MiluiAstor手持一柄乌黑的长箭在亡灵之地游荡。我想他一定是成为了亡灵，为法师效力，我不愿看待昔日的领导者堕落，于是加入了Tco的组织，这恐怕是反抗军之后唯一一个能与法师对抗的组织。“但随着时间的流逝，Tco的组织没有多大成就，我也不再执着与寻找MiluiAstor并挽回他，我开始自甘堕落。“故事结束了。”听到这里，FaH不仅后悔万分，为什么在亡灵之地没有仔细搜寻一番。他欲哭，却早已耗尽了泪水。不知不觉，当FaH从这回忆中回过神来，Sam早已离开，自己也躺在床上。他注意到此时的墙壁上多了一个冰原狼徽标，他把徽标摘下来，发现背面写着一行小字： 我对不起你的父亲，没能鼓起勇气和他作战。我撒了谎，我切身面对过MiluiAstor的亡灵。 FaH一阵头晕目眩。 他醒过来了，发现自己的汗水已经尽头了衣衫。FaH大吃一惊，连忙拿出那本编年史。幸好，那本书没有被浸渍。他这才想起来自己本来是想看看这本书的，但是眼下他要找到Tco。“算了，转念一下，不如先去洗漱一下，换身干净衣服。”FaH想，Tco估计在忙着，不然也不会这么长时间不见面。于是FaH找到Sam，在Sam的指引下进入了洗浴室。Tco找到了Tdl，准备再去一次要塞。“走吧，希望这次别遇到上次的怪物。”Tdl闷闷不乐。“不管怎么样，我们也要做好充足的准备。你的剑和盾牌拿了吗？”Tco不知从哪搞来了一支驽。“当然，还有horn草药。”Tdl点了点头。Tco和Tdl再次来到了那个隐秘的入口处，Tco刚准备拉下拉杆，Tdl却止住了他。“不对劲，有人来过。”Tdl说，“你看那个拉杆，上面有许多白色粉末。”Tco用手指蘸了蘸，搓了一下。“啪嗒”一声，一阵蓝绿色的火光闪烁了一下。“是照明石粉末。”（注：就是磷石）Tco站在那里沉思了一会。“是FaH，我感觉到了。他怎么会知道这里，他不是刚来这里吗？”Tco疑惑了。“走，去他房间看一眼。”Tco拉着Tdl走了。走进大厅前，Tdl隐隐约约感觉到了一阵寒意。他们前脚刚走，一个身着黑衣，头戴面具的人就如影子一般快速闪现在走廊里。 “MaegAstor，我来找你了。”他轻声说。此时FaH还泡在木桶里面。他突然感觉到了一阵寒意，于是从木桶里爬出来，赶紧换了一身干净的衣服。“有人在盯着我。”他自言自语。FaH离开了洗浴室，他快步走向自己的房间，迎面撞上了赶来的Tdl和Tco。“哇，FaH好久不见。”Tdl欢快的打着招呼，“你看起来很难过。”“是啊，刚刚和Sam聊了聊往事。”FaH勉强挤出一丝微笑。“你拿到的编年史可否借我一阅？”Tco问，FaH刚想吃惊，转念一下他们毕竟都能互相感应到，自己又没有理由拒绝，于是只好答应了。“你们在调查Theseus吗？”FaH突然不知道从哪里来的底气，随口问了一下。","categories":[{"name":"Novel","slug":"Novel","permalink":"https://allen2010.github.io/categories/Novel/"}],"tags":[{"name":"fantasy","slug":"fantasy","permalink":"https://allen2010.github.io/tags/fantasy/"}]},{"title":"Outerside Legend No.1","slug":"Outerside1","date":"2025-05-19T13:23:54.000Z","updated":"2025-08-08T11:18:42.243Z","comments":true,"path":"2025/05/19/Outerside1/","permalink":"https://allen2010.github.io/2025/05/19/Outerside1/","excerpt":"That's a story about Lose And Find.","text":"上部 Lose And Find 失而复得Written by：AllEnDlLes(Allenec2010) Prologue“须弥之境的边缘，一个向来安静祥和的村庄。人们称它为埃兰塔尔，他是天下最美的星光~“金·德利拖着疲惫的身躯一夜未眠。他看了看窗外，夜间最后一盏油灯也熄灭了，整个埃兰塔尔显得冷清，屋檐上的乌鸦与骷髅般的枯树无不透露着阴森与恐惧。此时已经是午夜时分，月光也在云彩的怀抱中闭上了眼睛。一片黑暗。“差不多了。”他心里说。他转身，抱起身边的一个包袱，走出了房间，来到一个水井旁，靠着井沿坐了下来。猛地，门外传来了细小的响声，一道黑影一闪而过，隐入了旁边的花丛中。金看着手中的包袱，将一枚金色的圆形徽章别到了包袱上。看着徽章反射出的月光，金陷入了沉思……那是3年前的同一个夜晚。正是在这里，金发现了自己真正的潜力，也在这里，失去了一生挚爱。他仿佛能听到当时雀跃的叫喊，和凄厉的呼唤。金眼角抽动了一下，缓缓站了起来。阴影慢慢逼近，金知道自己的时间不多了。他长叹一声，把包袱放在井沿，从衣服里抽出一柄长剑。霎时，三个黑影团团环绕，将金围在了最中间。他们也掏出长剑，直指金的面门。“你知道我们想要什么，对吧？”其中一个黑衣人挑衅的看着金。“是的，因此你们也得不到他！”金厉声说。“得不到吗？你好好看看你的处境吧。”另一个黑衣人冷笑着。金没有多嘴，他挥动长剑，劈向冷笑的那个人。那人不躲不闪，竟直接用身体挡住长剑，随即他手起刀落，刺中了金的左胸。金强忍疼痛爬到井边，对着黑衣人大喝：“好啊，那么谁也别想得到它！”金提起包袱，把它扔进了黑黝黝的水井。“不！——————”一声惨叫，那些黑衣人竟然化成灰尘，飘进了夜色之中。金一下子瘫倒在地，他这才感觉到自己的伤口突然消失了。然而正当他起身之时，一股黑色的气息却悄无声息地跟随着他，与他融为了一体。 I The Chosen One“‘嘿，来看看我找到了什么东西！’Mrs 闯进屋子，他拉着 Tco飞奔出房屋。‘等等我！’Emr也紧跟其后。Mrs带着他们来到了小松林的中心，在这个他们来过无数次的石台上，竟然出现了一个木匣子。Mrs故作神秘地鼓捣了一阵，转头看看 Tco，又转了回去，假装挠耳朵。‘怎么啦？’ Tco刻意语调高昂地说。‘嗯……这个……’ Mrs支支吾吾的挠了挠头，‘没打开。’‘嗨！这有什么难的，各位看我展示！’ Tco高傲的走上前，双手一挥，一道蓝雾闪过，那木匣子竟然自己缓缓打开，一道刺眼的白光射了出来，众人赶紧捂住眼睛。‘嚯！这不会是一把剑吧’白光散去，Emr 惊叹着说，探头仔细观察‘看起来有个把年头了。确信。’‘确实是，而且上面还有王族的符文，应该算得上一件稀世珍宝。’学识渊博的 Mrs 点头赞许。‘咱们就应该把它藏起来，嗯？’‘啊，所以没有人对这个盒子是如何打开的很好奇吗？’ Tco 不甘心。‘是的，没有。’‘不就是有……等等，难道你就是传说中被星光选中的人？’”他再次失败了。自从那次与安德森王国的战争，他再也记不起以前的事了。那次幼年时无知的聚会，最终以什么收场，都不会是好的。曾经光芒万丈无人不晓的 Tco，曾经号称天选之子拯救苍生的 Tco，终于一蹶不振，倒地不起。即便他战胜了安德森，魔影也会迷惑住百姓的心智，事情终将会向对他不利的一面发展。无论如何，他已经成为了带来邪恶的罪人。他无奈地走出木屋，抬头看着须弥的天空。这里，他想到了他梦开始的地方——乌尔腾。于是他义无反顾地背上背包，拿起一卷地图，离开了须弥的家。 “怎么样，想好什么时候走了吗？”SR走了下来，木制楼梯发出“嘎吱、嘎吱”的声音。他已经在楼梯下和那位“朋友”——Elf Erarllic交谈了整整30分钟。Elc是精灵族的一员，是个可靠的精灵。“不，我想还没到时候。”Tdl疲惫地说。“他认为我还有很多东西要掌握。”“好吧，但愿你早日拥有。一刻待在魔影的笼罩下，就一刻不得安宁。”Sr失望地摇了摇头。“当什么时候你能够独自上路，也就是什么时候该离开须弥，前往弩门诺尔了。”“你一直这样颓废可不行，你要抛弃过去的劫难，正向面对未来。”一直没有发话的 Elc 发话了。Sr也点了点头：“想想你父亲是怎么死的。”“没错，有朝一日我会为我老父报仇的。但不是现在。我要好好练练我那三脚猫式的剑法。再说了，我连仇人是谁都不知道。”Tdl依旧很颓废。Elc静静地注视着躺在懒人沙发上的Tdl。过了一会，Elc站了起来，走到Sr身边，低声对他着耳朵说：“他身上有很多谜团，我也无法看清。但我能意识到他有一股十分神秘而古老的气息。或许那就是传说中的星光之力。为了他的安全，……” Sr点点头，两人相视一笑：“是时候了。”深夜，漆黑的房屋里点起了一盏昏黄的油灯。Tdl悄悄地打开抽屉，从里面抽出了一本残破不堪的古书。他停顿了一下，侧过身子仔细听着门外的动静。过了一会，声音不见了，他放心的回到床上，把灯用被子盖住，翻开了第197页，书上赫然显现着一个大标题：古老的救世主：伦诺克斯。他继续往下看，书上用黑笔标出了一行小字：伦诺克斯天生在右臂上有一个蛇形标志。Tdl看完点了点头，又起身把油灯掐灭，悄悄地把书放回了柜子里。……第二天早晨（还没到）。“好啦，起床吧，今天要办的事可不少！”Sr走进Tdl的房间，拍了拍他脑袋。“干嘛！”，Tdl不耐烦地坐起来，整了整自己的衣服。“什么事这么早找我，才4：20啊！”“我看可不是没睡好的缘故。我明明看见你刚才还在点着灯熬夜看传说故事呢。别以为我不知道。”Sr指了指快要烧完的灯芯。Tdl感觉自己脸红了，连忙低头假装整理床铺。“好吧，你这几天这么浓的黑眼圈，除了熬夜还干什么了？”“趁你们午休时候偷偷出去翻看那本剑式百科。我还以为你早看出来了。这几天我的剑法可进步了不少。”Tdl仍然是那么爱开玩笑。当然，这句话他说的没错。表面上Tdl一副花天酒地的样子，其实为了报仇可没少做准备。他每天都会谎称去城里钓鱼，实际上是去教会的图书馆里查阅有关他身世的资料去了，尽管什么也查不到。这是当然的，毕竟图书馆不是专门为他盖的。关于他的身世，你马上也会知道的，不用着急。“说正事吧，我听听。”Tdl说。“昨天Elc想了一夜，他认为你也有许多值得赞许的地方，而且各项技能也都掌握的差不多了。”Sr 说。“好啊，挺不错。然后呢？”Tdl嘴角提起了一丝微笑。“然后你就要同我们一起前往弩门诺尔，并告诉我我那不为人知的身份，对吧？”Sr一怔，没想到Tdl后面的话却让他更为震惊。“嗯，是的，我已经知道了自己的身份。我是一名伦诺克斯，星光之子。也正是因此，我感到迷茫而无所适从。用遥远的东方一位圣人的话说，就是“罔”。我能感受到其他伦诺克斯的召唤，但大多数都是黑暗深渊中的呼喊。我无法分辨出我应该跟随谁。”Sr沉默不语，似乎在快速思量着什么。终于，他说话了：“好吧，今天似乎更忙了。我去下面通知一下Elc，你去准备一下马匹，看来事情比我们想象的要复杂。”Tdl从床上坐起，摊开手心，将那枚一直佩戴的金色圆形徽章对准油灯，反射出来的光映射在身后的阳台上，呈现出一个模糊的人脸，熟悉而陌生。突然，那张脸抽动了一下，Tdl一惊，金色徽章掉在地上，那个人脸随之消失。Tdl再次捡起徽章，又一次对准，这回，那张脸更加清晰了，Tdl惊奇地在那张棱角分明，看着像反派的脸上看到了自己的影子：狂野、放荡、坚毅而激进。随即Tdl就听到了Elc悠扬的歌声。这歌声像是有什么魔法，穿透层层墙壁，提醒着Tdl他生来的使命：指引Outerside的人民，为世间带来智慧与美好。他收起徽章，漫无目的地走下了吱嘎作响的楼梯。Sr和Elc都已经离开，现在空旷的房间了，只剩下了Tdl一个人。Tdl看着清冷的房屋和屋外的水井，仿佛想起了什么。 II Smiloton-Skewro’s在须弥因萨克小镇的中心，一座巨大的帐篷赫然耸立，里面映出的灯光在冬日黎明前的黑暗中格外显眼。帐篷里是一个巨大的木台，上面有一口巨大的坩埚，连接着一个模具。台下挤满了人，这些人都是小镇中的原住民，前来参加仪式。符文烙印是须弥的传统，原住民在这里即将远行时都要烙印符文，标记自己的归宿。坩锅下的熔炉燃烧了起来，村民们排成一列依次经过熔炉，向里面丢进一些不知名金属器物。所有村民都已经走过，坩埚冒出蓝色的火光。Sr上前拉开闸门，金属流进了下面的石头模具。Sr拿起一根铁钳，夹起模具中的那枚尚未凝固的暗红色挂坠，向墙角的两人点了下头。Tdl走上前，鞠躬伸出右手，等待着烙印的疼痛。Sr走近，将烧红的挂坠按在了Tdl的手背上。他的眼角抽动了一下。若干秒后，Sr将挂坠取下，低头看向手背上的符文——一条弯曲的弧线缠绕着一个T字。符文烙印仪式结束，Sr将挂坠用银链子穿起来，挂在了Tdl的脖子上。整场仪式没有任何人讲话，但无形间的庄重肯定了这场仪式，也代表着Tdl的家的方向，代表着他是须弥之乡的人，体内的坚毅永不磨灭。随着仪式结束，帐篷的骨架和帆布被拆解，一切又回到了往日的平静。“快，把马迁过来，趁着夜色未尽咱们快走！”Elc朝Sr招招手。Sr和Tdl心领神会，翻身上马，带上背后的兜帽，不停蹄地奔出了因萨克的大门。Tdl看着他曾经的家的废墟，陷入了回忆…………二人一Elf快马加鞭地走了一天，眼见天色渐晚，Tdl才从刚才的回忆中缓过神来。沿路上要穿过广大的洛风平原，可以远远望见高耸的洛风山脉和左侧的萨鲁曼德森林，可谓是大自然美丽尽收眼底。Tdl一想到沿路上的重重危险，就不得不希望把注意力转到身旁，观赏起了景色。萨鲁曼德的森林是传说中外境最美的亚热带森林，幽蓝的黄果树（没错，幽蓝的）、紫红高达的田旋木和尽显森林本色的墨绿红杉（你可能已经被绕晕了）构成了史诗一般的境界。“怎么样，被萨鲁曼德的美景迷住了？”Sr冷不防地问，Tdl这才转过头，看到Elc和Sr都在盯着自己，不知所措的点了点头。“好吧，最近也不是野兽出没的季节。咱们就去萨鲁曼德森林赶路吧。正好在哪里不容易被发现踪迹。”Sr说，他转过马头，向着左侧的森林飞奔了过去。Tdl和Elc紧随其后。”wow！太美丽了！Elc，那是什么植物？”Tdl感叹道。“那是段藤草。别看它花红果绿得，果实里有剧毒。”Elc说。他的族群曾一直生活在这里，因此他对这里最为熟悉。可惜后来因为精灵族寿命的原因，大多数都去了西方的乐土，再也没有回来。现在就算是还生活在罗尔森洲的精灵，也不在繁衍。因此，精灵一族越来越衰落了，变得十分稀有。Elc还很年轻，也是为数不多与人类一起生存的精灵。“我这么大，头一次见到这么大的凤旋花！它得比我都高了吧？还有那个，不会就是传说中的凤仙木？”Tdl感叹了一路，还摘了很多奇异的果子，放进包里。“小心点，别光顾着欣赏，注意脚下和身后，我嗅到了野兽的气息。”Sr突然警觉了起来。他皱起眉，翻身下马，蹲下身注视着地上的一片绒毛，陷入了沉思。“狼？”他低声说，“不可能啊，冰原雪狼不可能在这里……”过了一会，他站起来了，把那搓绒毛揣进怀里，翻身上马。“走吧。继续出发。”似乎是怀疑自己的处境，这一路上Tdl也没再说话。因为他再次感受到了那股异样的气息。随着他们对森林的深入，树木的种类越来越多，形态越来越奇异。偶尔，他们还看见过一两只小飞兽。但空气也逐渐变的浓稠潮湿，压抑难忍。“算了，咱们出去吧，我在森林里受不了。”Sr突然说，Elc和Tdl没有回答，默认了这个答案。他们早就想出去了。Elc带路，几个人几分钟就走出了森林，继续在平原上骑马。在森林里不知不觉，外面天色早已黑透了。几个人饿的咕咕叫，寻思找点吃的。Tdl从马背的包里拿出一盏油灯，点亮了夜色。“你带了什么吃的？”Tdl问Elc。“呃？几根面包棍和两片肉干。奥，还有一点黄油。”Elc回答。Tdl摇了摇头，从自己包里拿出了他和Sr连夜偷偷做的鸡腿。“快吃，吃完有劲赶路。”突然，远处传来几声嚎叫，在洛风山脉的余脉中久久回荡。“今天是真倒霉，咱们碰上狂兽了。”Sr无奈地摇了摇头。“不用担心，他们在夜里看不见咱们。”Tdl自信满满地说，从马鞍上站起来整了整自己的裤子。“可惜马上就要天亮了。”Elc抽出一柄长弓，指向远方的地平线。一轮红日缓缓升起，仿佛害了羞般，将远方的云彩照的通红通红。远处，两个黑点缓缓向一行人靠近。Tdl警觉地拔出了长剑，Sr也提起了挂在马背上的盾牌，翻身下马，紧盯着远处正在快速变大的黑影。突然，黑影停了下来，侧过身，仔细观察着远处的三匹马和两个人类。哦对了，还有马背上拉着弓的精灵。“这不对劲，”Sr拿出一面小玻璃片，透过玻璃仔细观察，“它们比普通的狂兽要大，颜色更浅，貌似……牙也更长”。“看来咱们摊上大祸了，这是剑齿狂兽，专门猎杀 人类的凶狠捕食者。”Elc无奈地摇了摇头。“可我明明记得它们早在几百年前就灭绝了呀？”Tdl咬了咬嘴唇，肯定地说：“我能感受到一股邪恶的念力在操控他们。他们应该是被堕落的巫师操控的傀儡。我们要多加小心，它们可能比剑齿狂兽更为冷血。”话音刚落，两只狂兽就飞奔了过来，Tdl也看清了他们的长相——两只丑陋的怪物，长着黑豹的头，剑齿虎的牙，浑身一层令人恶心的灰白色毛发，突起的肩胛骨上刺出一排紫黑色的长刺。最显眼的，是他们胳膊肘上的两根骨灰色的长刺。长刺上的毒。常常被后人用来做成毒药，因此也叫牢大灰顶毒。转眼间，跑的快的那只已经朝Sr飞扑了过去，一跃而起，将自己的利爪伸向Sr……霎时，这只狂兽却在飞扑途中身子一歪，倒了下去，柔软的咽喉上插着一只锋利的羽箭，然后……“然后它就死了？”Sr不敢相信地说。“箭头有毒”Elc看都没看它一眼，拿起了第二支箭。说话间，另一只狂兽也跑到了阵前，他比前一只更修长，更强壮，也更谨慎。只见 Elc 再次射出箭矢，但羽箭并没有像料想中一样深入皮肉，而是刺在狂兽的皮肤上，停留了一会，掉了下来。“可恶！它毛底下有层骨板！愿他被爱奴的烈焰灼烧！”Elc咒骂了一句，拿起长刀，翻身下马。狂兽渐渐逼近，每个人拿着兵器的手都在颤抖，等待着狂兽跃起的那一刻，也是他们击杀的唯一机会——狂兽的脖颈没有铠甲。可它却迟迟没有攻击，而是绕着赶路小队不停地徘徊，低吼。猛然的，狂兽转过身，将自己的尾巴甩向Tdl。Tdl一个闪身躲过，但身后的Sr却被打的结结实实，惨叫一声横向飞出了五米。随即狂兽又弯曲前腿，然后一个肘击，前腿关节处的骨刺刺向Elc。Elc连忙举起刀格挡，却没有注意狂兽紧接着翻身的动作。Elc的刀被骨刺卡住，狂兽一个空翻，Elc重重地摔在灌木丛里，半天没爬起来。就在狂兽的剑齿就要刺穿Elc的腿时，一道银光闪过，Tdl挥剑斩断了狂兽没有护甲保护的尾巴，趁着它吃痛转身时猫腰躺在了狂兽身下。狂兽似乎有所察觉，想要通过自己1吨的体重把Tdl压死，却没想Tdl借此机会利用它体重产生的重力将狂兽那厚重结实的皮肤切开了一道口子。长剑将狂兽穿胸而过，狂兽瞬间泄了气，无力的倒在了Tdl身旁。随着一声恐怖尖利的哀嚎，两只狂兽的尸体随风飘散。Elc挣扎着爬起来，连忙和刚起身的Tdl一起跑到重伤倒地的Sr身前。Sr右臂被狂兽的尾巴抽断，肋骨接连受到撞击，现在已经是强弩之末，无力回天。看着准备上前包扎伤口的Tdl，Sr双眼失去了光芒，只留下一句断断续续的遗言：“埃尔诺……艾克赛特公爵……帮助……你”。Tdl跪在地上，闭上了眼睛，在胸前比了一个S形。这个世界上，他唯一的亲人也离开了他。很难想象，他后来是怎样在自责和无助中找回自我的。“没关系的。现实就是这么残酷，但你必须要面对它。让我们对Sr进行最光荣的送别。”Elc蹲下，拍了拍Tdl的肩膀。“但必须要快，好像又有几只狂兽向这边赶来了。我听到大地传来了震颤，数量不会少。”Tdl睁开眼睛，始终没有直视Elc，只是点了点头。 III Lurking HunterTdl和Elc不敢怠慢，他们尽最快的速度挖出了一个坑，为Sr进行了简单的葬礼，就继续上路了。Tdl十分懊恼，他认为是自己的疏忽导致了Sr的牺牲。他明明可以速战速决，让自己挡在队友前面。为什么死的不是自己，而是Sr？Tdl一路上一直在强迫自己回答这个问题。猛然间，Tdl仿佛看到了那张脸，那张和他很像，却有能力以自己的牺牲保全他人的脸。Tdl再次陷入了回忆。那天上午，在阳光的照耀下，Tdl父亲的脸显现了出来，他深切的看了Tdl一眼，意味深长地说：“找到他，他能指引你，但一切要你自己去领悟。”一阵寒风将他带回了现实，转眼间，他们已经来到了雅兰湖畔。虽是夏秋时节，雅兰湖畔的风仍然使人心旷神怡，许多动物也来到这里避暑。只可惜正在赶路的二人没有时间欣赏这猎食者与食物和谐共享一片避暑胜地的美景，停留在此匆匆补充完水壶就匆匆离开了。随着时间的推移，过了将近一个星期，早已疲惫不堪的Tdl和Elc（和马匹）终于远远望见了屹立于弩门诺尔平原中心的埃尔诺城，但要想过去，就必须穿过漆黑幽深的泰坦森林。泰坦森林是一片由亚热带常绿阔叶林和温带落叶阔叶林交错而成的原始森林。传说这里面充斥着远古时期的魔法，因此被泰坦森林分割的北弩门诺尔成为了人类与矮人的天堂，不会受到外部猛兽的干扰。当然，冰原雪狼不会南迁到如此低纬度的地区。经过了长途的跋涉和内心的矛盾冲突，Tdl早没了力气。鉴于马儿也是相似的状况，Elc选择了快捷但相比下更危险的水路。正巧Elc一族的精灵原本就居住在须弥的雨林附近，编制木筏是每个精灵都会的手艺。看见躺在马背上一动不动的Tdl，Elc没办法只能一个人制造。泰坦森林的边缘常驻着一种奇妙的植物，名叫龙须树。它奇妙的地方不在木质部，而是从树干上垂下来的又粗又长的藤蔓，这些藤曼其实是龙须树繁殖的方式，叫做气生支柱。这些结实轻盈的藤蔓正是制作船舶的好材料。尽管如此，Elc独自一人忙活了半天也才做出个骨架。Elc意识到这样下去不是办法，毕竟在连着好几天没吃正经东西，长途跋涉还要一个人制造两个人的船的情况下，就算是身体素质再好迟早也要累死。于是他只好叫醒了疲惫不堪的Tdl，让他帮忙。Elc走到马背后，轻轻拍了拍马头，马立刻站了起来，Tdl也失去平衡，倒了下去。随后，Elc就带着满脸怨气的Tdl走到了树下。“也就是说，我只用砍几棵藤蔓就行了？”Tdl问。“没错。我看你最近精神也不太好，简单帮帮我就行了。当然我一个人也干不了俩人的活。”Elc回答。于是经过两人合力的两个小时努力，终于把船做好了。天色也间晚了，Elc本想睡一晚明天再走。但Tdl害怕狂兽再次追过来，所以想要连夜穿过泰坦森林。Elc不知可否，但身后的嚎叫再次响起，也没有别的办法了。“快走吧，我可不想在被狂兽突袭。要不然一个人备受两位朋友的离世可不是什么好事。”Tdl率先跳上了船。“等会，我去砍树皮拿来当桨，咱们轮流划桨，能快点吧。”Elc做事一丝不苟的特点可谓是淋漓尽致。于是两位心灵相通的挚友就这样划着小筏子投入了黑暗的泰坦森林的怀抱。 水路果然比陆路快得多，在Tdl倒头就睡的第二个下午，他们已经接近泰坦森林的边缘了。Elc一路上一直很紧张，因为他听到四周传来了恐怖的鸟叫和哀嚎，虽然模糊，但却让人不寒而栗。Tdl倒是凭借强大的抗干扰力睡着了，但这一睡就是一整天，然后一睁眼，就开始发现自己已经一整天没吃东西了。“Elc，你带干粮了吗？”Tdl问。“带了我也不给你，谁让你自己三天就把他们全吃光了。”Elc瞪了他一眼。好吧，幸好刚进森林时我摘了点果子。就是太酸了。”Tdl摇摇头，抓了一把灰绿色的果子塞进了嘴里。“倒是水分挺充足。”吃完果子，Tdl突然说：“我感到四周有阴影的气息，但和那种狂兽傀儡所散发的不大一样。”果不其然，话音刚落，四周就溅起一片水花，一只巨大的鳄鱼露出了它的脊背。可正当Elc紧张之时，Tdl说：“不，不是这只，应该是其他更凶狠的捕食者。”Tdl就是Tdl，身为伦诺克斯的他洞察能力是其他种族望尘莫及的。那条鳄鱼没有朝木筏游几米，就在一阵水花声中消失在了浑浊的河水中。“Wtf！赶快把船停到岸边！这水里有更™大的捕食者！”Elc大喊。Tdl连忙手忙脚乱地把船听到岸边，然后和Elc跳到了岸上，不过有惊无险，就在他们跳上岸的后一秒，一只巨大的蟒蛇窜上了他们的船，看也不看一眼就直接用身体把筏子缠住，然后只听“咔嚓”一声，Tdl辛苦搭建的木筏彻底碎成了碎片。“它的鼻子是不是有什么问题，怎么没有感觉到我们？”Elc疑惑的问。“嗨，略施小计，”Tdl不屑地说：“只不过把之前骑马时留下的马的鬃毛撒在上面了而已。趁它还没反应过来，咱们快走吧！”于是二人一路上连滚带爬，披荆斩棘，走了一天一夜，终于还是体力不支，倒在了森林的边缘。第二天早晨清晨的第一缕阳光照射在Elc的脸上，Elc一惊，发现自己躺在一张铺着茅草的床上，貌似是在一个房间里。Tdl也在另一张床上，但他已经醒了，正在下床。这时，房间的门打开了，是一个贵族装扮的中年人，留着灰色的长胡子。“欢迎来到埃尔诺城。我是这里的院长，艾克赛特公爵。相比你就是泰德（Tdl的名）吧？”他走到Tdl面前，问。“正是在下，此外，谢谢您的救助之恩。”Tdl起身，鞠了一躬。“哪里，如果你没什么事的话，你愿意来一趟我的房间吗？” IV Exetor’s Invitation两人走进艾克赛特的房间，眼前是一张榆木办公桌，桌子两次分别是一把椅子和一座沙发 。看见艾克赛特已经坐在了那把椅子上，Elc和Tdl就坐在了另一边的沙发上。“好，人都来了，我就开门见山，长话短说了吧？”Tdl点点头“尊敬的伦诺克斯，我等你等了好久。我曾经是你父亲的老友，也知道你心底最想干的事。”艾克赛特露出了一副奇怪的表情，耳朵涨成了猪肝色。“幸会幸会。”Tdl礼貌的回答，但他私底下却在疑惑。“而且我知道……我知道你父亲是谁杀死的。”艾克赛特如释重负。Elc震了一下，但他很快就平静了下来，同时也在心里产生了疑虑。Tdl并没有像料想中那样情绪激动，反而静静地盯着艾克赛特那张涨红了的脸，静静地说了一句：“嗯，继续吧。”“果然啊，小伙子成长了。”Elc心想。艾克赛特公爵明显也十分惊讶，但他毕竟是年过花甲，自然没有将那一份惊讶表现出来。他平复了一下自己的心情和不听话的嘴巴，再次问Tdl：“如果我能帮你找到杀父仇人，你愿意与我合作吗？”Tdl再次陷入了沉思。终于，他说：“恐怕以我的能力，就算是加入你们也得不到重用。”“那你有什么要求？”“我希望其他伦诺克斯的开导。”Tdl静静的说，但其实心里早已掀起了波澜壮阔的风浪。艾克赛特公爵想也没想就爽朗的回答：“当然没问题，我恰好认识几位。”“几位？！”Elc这回吃了一惊，不小心碰到了面前的一只牛顿摆。他连忙手忙脚乱地因为一位伦诺克斯就已经像是大海捞针般难找，更别提几位了。而且传说这世上一共就只有5位伦诺克斯还活着。那么……这意味着很么呢？想必各位都已经明白了。埃克塞特公爵起身从桌子上站起来，走到一个柜子旁，打开了玻璃柜门，从繁杂的文件堆里找出了几张名片，递给了Tdl。“还有什么你想跟我说的吗？“Tdl问。“当然，我要告诉你 那位“大人”的地址，帮助你大仇得报。“艾克塞特公爵说，但是眼角闪过了一丝阴险的微笑。这一点，被善于观察的Elc注意到了。当然碍于面子，他也没说什么，只是简单的与公爵道别后跟着Tdl离开了。他们的房间离公爵的办公室很远，要横穿一座塔楼，脚下是半透明的玻璃，显得科技感十足。这座塔楼正是埃尔诺城的中心，也是几天前他们在泰坦森林看到的那座，它由古代的工匠制造，一砖一石都是精心挑选和磨砺的，经过早已失传的榫卯工艺组合后，成为了一套坚不可摧的防守工艺。塔楼的形状也十分美观，呈狭长的倒三角形，各处都开有发射弓箭的箭孔，和用来指挥的阳台。Elc来时没有特别注意，现在方才感叹古代技术的精湛与宏伟。穿过塔楼他们就来到了居民区，里面住着弩门诺尔的人类平民、贵族、商人和战士。他们的房间也在这其中，只不过看起来像是专门给客人预备的，更庄重、简朴一些。回到房间后，Elc锁紧了房门，然后走到书桌前坐了下来。“这个埃克塞特公爵不大对劲，但也没有别的方法。“Elc皱起了眉头。“嗯，”Tdl回答，“我能感觉到一股奇怪的气息，和那两只狂兽很像。但我们不能轻举妄动，毕竟他也没对我们造成什么伤害。可能只是单纯的心里比较阴暗，这种阴暗只要能够被自主控制应该就没什么危险。”“先走一步看吧，咱们明天可以去找那几位伦诺克斯讨教讨教。”“只能这样了。”“我先出去转转。”起身，Elc离开了房间。Tdl习惯性的腰间摸了摸，但没有摸到那枚金色徽章，却摸到了那几张写着伦诺克斯姓名和他的杀父仇人的名片。“坏了，我把徽章给丢了！”Tdl仔细思考着什么。他已经确认了艾克赛特对他隐瞒了什么事实，而且千方百计地不想让他知道。消失的徽章就是有力的证据。可是他想隐瞒什么呢？Tdl走到床边，看着远处高耸的青蓝色山峰和山下茂密的泰坦森林，陷入了沉思。泰坦森林中突然飞出的一个银蓝色身影吸引了他的视线，那是一只穿行者飞兽。一个小时后Elc回来了，还带来了一个消息。“我在外面打听到，在乌顿地区又有三个人失踪了。我想这可能和最近几天魔影的扩散有关。“Elc说。“怎么可能，魔影只不过是传说罢了。而且就算是真实存在，你也分辨不出来。但我还是认为其地不宜久留，咱们明天就走吧。我的黄金徽章不见了。”Tdl无奈地说。“看来，事情远比我们所想的要复杂得多。“我也发现了一件怪事，”Elc说：“我在艾克赛特公爵的办公室里偷到了这枚徽章。”“你还精通这个？”Tdl略显惊讶。“小事而已，反正他也没在里面。”Elc摸了摸下巴。Tdl如然想起了什么，他从腰间拿出那张写着仇家的名片，却发现那上面的名字十分令人熟悉：Tco；住址：乌顿沿海，格兰陵。 V AirSileris关于格兰陵，大多数人都会想到陵墓。其实不然，虽然名叫陵，但本质上它其实是几百年前由上一任乌顿领主所修建的，用来供奉传说中的乌顿星光——格兰的祭祀神殿，完全是音译，原称 $\\frak{Goeslearian}$。不过一个杀了人的人还敢在星光祭坛这种神圣的地方生活，依然是令人匪夷所思。但是Tdl他们并没有多想，而是转而去寻找那几位能开导他的伦诺克斯。第二天一大早，Tdl和Elc就和公爵道别，用各种借口推脱了公爵的挽留。Tdl还“借”了两只飞兽，骑着他们可比骑马快多了。但是Elc的飞兽貌似不是很好控制，他安抚了整整一个小时，并用精灵语跟它沟通，最后也仅仅是以一顿小羊排为条件达成了共识。Elc牢牢地抓住了飞兽肩胛上的两根骨刺，两腿一蹬，飞上了蓝天。Tdl紧随其后。“好，放轻松，到了目的地我就给你吃，好吗？（精灵语-中文翻译）”Elc用手轻轻地抚摸着飞兽的头颅，竭尽全力安抚着它，Tdl在一旁嘲讽。“菜，就多练！”“好，你这么说，我估计你上你连骑都骑不上来。”Elc回敬道。高空飞行并不是什么有意思的事情，直奔脸颊的寒风和路途中的颠簸的是常人难忍受的。但是快捷毕竟是最重要的，所以Tdl一路上一改乱说藏话的习惯，紧闭着嘴，遭着老罪。他只能勉强感到前面的景色，但这也算是旅途中的一点慰藉罢了。不久，Tdl就饿了，两只飞兽也饿了。于是Elc带着它们降落到地面，放飞了他们。“你这是在干什么！没了他们我们可怎么赶路！徒步吗？”Tdl十分地不解。“你要相信我的实力，我对他们承诺了，他们也会信守承诺地回来的。”Elc一脸轻松，从旁边的尖齿树上摘了两个角瓜。“给，萨鲁曼德特产。”角瓜长得十分难看，如同一只变异的火龙果，橙色的外皮和不均匀分布的软角还有一咬就爆浆的口感一度令Tdl十分反胃。但过了一会他就放下了心态。“嗯，刚开始还有点不乐意，其实仔细品尝这玩意味道还不错。”Tdl用袖子擦了一下粘着橙黄色汁水的嘴。“可是你已经把这棵小树上的果子全吃光了，不打算给我留一点？”Elc皱起了眉头，嗔怒道。Tdl从背包里拿出了一块面包，说：“你吃这个不就好了。”Elc瞪了他一眼，走到小河边坐了下来。他不知道从哪里摸到了一把鱼竿，开始钓鱼……“喔！鱼上钩了！”Tdl突然大喊，Elc应声拉杆。果然，一只巨大的不知名鱼类被钓了上来。“看来咱们和飞兽的晚餐有着落了。”Elc说。话音刚落，一声长鸣，两只飞兽如期而至，Tdl惊讶的比了个大拇指。“厉害了！”不久，烤鱼香喷喷的气味就引来了饥饿的几个人和动物。他们大块朵颐了一番，一米多的鱼就连骨头都不剩了。“好了………吃饱了，该上路了！”Tdl拍了拍肚子。两人骑上了飞兽的后背。吃饱了，飞兽飞的自然快。恰逢黄昏，Tdl远远就看见了沙漠中的那座宫殿。“瞧，目的地到了。”果不其然，不到半个小时，那座宫殿就出现在了众人的视线之中。飞兽缓缓地降落在地上，二人都爬了下来。这就是他们旅途的目的地：安德森，欧瑞克宫殿。沙漠中的宫殿本身就十分令人震撼了，更别提那黄金的穹顶，绵延十里的城墙和高大的屋顶。不知道为了在这座孤峰旁依山而建宫殿到底动用了多少努力的血汗。Tdl走到了宫殿的大门口。门口站着两名身披软甲，手持长剑的守卫，他们看见陌生人闯入，立刻大踏步走向前，拦住了Tdl一行。“你们是什么人？”其中一名守卫问。“啊，我记得艾克赛特公爵给你们的主子来过信……”Tdl故意拉着长腔调回答。守卫一听见艾克赛特公爵名字，立刻警觉了起来，但还是亲切的问：“啊，是的。我们主人确实收到过它的信。想必您就是Tdl先生吧？请进！进门直走的大殿就是尊贵的法师们居住的地方。”走进了宫廷的大门，Elc不禁奇怪的问：“法师？我们不是要找伦诺克斯吗？”“啊，这你就有所不知了吧，法师是安德森地区对伦诺克斯称呼，原因是我们的特殊能力在外人看来就像巫术一样。我想他们会给我很大帮助的。”Tdl边走边说。古城门距离那座宏伟的大殿起码有一两千米，沿路稀稀疏疏地分布着一些买工艺品和面包的小商铺。其他地方要么是小树林，要么就是住着村民的房屋和花园，看起来十分祥和。Tdl边走边想起了自己的故乡，不由自主地哼出了家乡的小曲。“须弥之境的边缘~一个安静祥和的村庄。美丽的~森林花丛，耸立的山脉环绕。远征的英雄归途，王者归来的盛世。人们称它为~埃兰塔尔，是天下最美的星光~”不知不觉，他们已经来到了大殿之下。大殿建造于高台之上，由数百节大理石楼梯与地面相连。它本不是由安德森的国王派人建造，而是在几千年前第一位至高王的统治下，Outerside的人民集体建造的。因此，它采用了古典式的希腊柱式建造法，顶部的钝角三角形穹顶与地面形成了近乎完美的黄金分割组合。在古代，安德森地区并不是荒芜的沙漠，而是水土丰美的热带草原风光。但由于后几位至高王的贪图享乐，使这里的资源严重短缺，最终沙漠化。Tdl三步并作两步，迅速顺着阶梯来到了台面顶层。他尚未走进，就听见黑暗的大殿中传来了一声平静的问候：“年轻的伦诺克斯，久等了。”Tdl缓缓地走进大厅，边走边欣赏着古代帝王所留下的浮雕们，他们无不传颂着远去的幸福和古老的传说。Tdl穿过走廊，打开了一扇门，门里漆黑一片。终于看见了一丝亮光，但也仅限于一丝亮光。大厅内只有一两只蜡烛在燃烧，火光映在一张冰冷的面具上。“法师不喜欢亮光，但因为你的到来，我不得不点起蜡烛。”戴着面具的那位伦诺克斯说，“我知道你想要什么。因此，你会接受我的思想传承。过来吧，年轻人，让我看见的眼睛。”Tdl有些疑虑，他不明白自己所敬仰的前辈们为什么是这样一副模样。这里的阴暗、潮湿、混沌、不祥无不让他感到恐惧。“请证明你就是伦诺克斯。”Tdl声音明显的开始颤抖。“证明我？很简单。只要你肯相信我，你就能知道我是不是真正的伦诺克斯。”法师说。Tdl没有说话，但他扭曲的表情暗示了一切。他点点头，坐到了法师面前的凳子上。Elc也想跟上去，但法师挥了挥手，Elc只能无奈的离开大厅，走之前还不忘把门也顺带关上了。“很好。我想你知道自己的使命，对吗？当然，我理解你的感受，你想报仇。我太理解了，我也曾经经历过这种丧父之痛。你要讲这种情绪加以利用、加以转化，听我的，年轻人，让仇恨占据自己的精神世界，坚定自己的信念，发挥自己最大的力量，然后完成使命。”Tdl默默的点了点头。“当然，我想你一定想知道有关于你身世的更多故事吧？我这就告诉你。”从法师那令人震颤的声音中，Tdl算是听明白了几句，事后他整理了一下，大概是这样的：Tdl的父亲原本是弩门诺尔的一名贵族，他有钱有势而且十分贤德，取得了当地不少百姓的尊敬。后来，弩门诺尔的国王不幸去世，他的儿子登基。由于新王朝的贪污腐败，父亲无法忍受，于是带着妻子和两个儿子搬离了平原，来到了有着最美星光之称的埃兰塔尔。在这里，他有了第三个儿子，正是Tdl。可Tdl的幸福时光没过多久，父亲就被一名邪恶的伦诺克斯——Tco杀死了，Tdl也被抛弃，从此失踪。后来，Tco的组织试图侵占安德森王国，王国被迫应战，最终Tco战败逃走。经此一战，Tco的势力大为削减，从此消失了踪迹。Tdl后来幸运地被自己的叔叔Sr抚养长大，从此开启了他作为伦诺克斯的人生。Tdl听完自己的身世，却并没有感到仇恨，他反而觉得经过法师的讲述，自己变得冷静，利落。他接着问：“那我的使命呢？作为伦诺克……”“仔细体会我跟你说的话，我们有缘再见。”法师说完，抬手一挥，Tdl突然睁开了眼睛。“你终于醒了，我等你好久。”Elc站了起来，Tdl感觉自己正躺在沙地上，被耀眼的阳光晒得刺眼。“我……我刚才不是在大殿里和伦诺克斯对话吗？”Tdl很惊讶。“没有啊，你刚走到大点的楼梯前就晕倒了。或许他是在用精神与你沟通。”Elc回答，他扶起Tdl，把他抬到了飞兽的背上。“你想好了吗，我们出发。”“嗯，”Tdl点点头，“去格兰陵，我要复仇。”“我觉得再等等吧，毕竟你连夜赶路了那么长时间，也应该好好休息一下。刚才我去打听了一下这附近的村民，有一家愿意收留我们，还说能有个伦诺克斯陪伴是他们的荣幸。”“好吧，那咱过几天再走。别忘了给你的飞兽吃点羊肉。”Tdl再次冷静了下来，顺便调侃了一下Elc。Elc的耳朵根紫了，他从地上抓了一把沙子抛向Tdl的脸，然后骑着飞兽跑了，只留下一片轻快的笑声。 VI Shadow Of Darklord“嘿，你醒啦？”Tdl反常态地起了个大早，Elc刚睁开的眼睛表示惊讶。“怎么啦，起这么早，是不是伙食太好了。”Elc挑了下眉毛。“我从菲力先生那里借了份地图，发现这个小区旁边有个图书馆，正好去查一查资料。”“怎么，不会又是那个什么魔影吧。当初可是你亲自告诉我那东西是传说的。”Elc说。“我觉得你就特别应该去法是哪里改造一下。还说我没有特质呢。光有特质没有素质有什么用。”Tdl回敬道。Elc没有说话，但Tdl突然笑了一声，Elc的耳朵根又双叒叕红了。他站起来，简单洗漱了一下，然后披上斗篷下楼吃早饭了。房东太太是个考虑周到的人，她知道Elc和Tdl起的都很早，所以凌晨就起床给两位异乡人做了早饭。“嗯，真是太感谢您了。”Elc吃完连连道谢“是啊，我头一次见到向您这么热情的人。这早餐很合我的胃口！”连挑食的Tdl都不得不承认。“哪里，这都是我们家乡的家常菜，和您胃口真是巧了。”房东太太连忙推辞，她对伦诺克斯的到来表示十分热情，对二人十分体恤。这栋小房子不大，但是很温馨。背井离乡十多天的Tdl头一次感到了家的温暖。“再见，我们中午再回来。”Elc向房东太太挥了挥手，和Tdl走出了房门。图书馆离小镇不远，但仍有一段距离。步行的速度大概10分钟能到。不一会，那座富丽堂皇的“图书馆”就映入了Tdl和Elc的眼帘。它精雕细琢的12根圆柱，拱形的石质大门和金光闪闪的穹顶以及大理石地面，不无展现着古代王朝的辉煌往日。但Tdl带着Elc径直走到了一个黑暗阴沉的屋子里，从古朴的木制书架上抽出了几张更加古朴陈旧的暗黄色羊皮纸。“嘘……这里是远古传说藏书区，收费，我刚刚是偷渡进来的，小声点。”Tdl压低声音说。他掸了掸纸上的灰，从柜子上拿了一块小抹布擦了擦。接着屋子里昏暗的灯光，他们看清了上面的标题：伦诺克斯——魔影笔记。“这貌似是一位古老的伦诺克斯所写的，他用的是萨尔特语，我读不懂。”Elc说。“没关系，我会，”Tdl说，“Sr教过我。”他低声的翻译了一边书上的内容，然后念给Elc听，内容大概如此：要提魔影，就不得不说一下巫师了。巫师是一类由人类成为伦诺克斯，在受到诱惑心灵堕落而产生的非实体。他们在堕落之初就受到了埃努诺尔的诅咒，因此会受到无比的痛苦：失去原本的实体，只剩灵魂飘荡人间。他们惧怕阳光，但永生不死，却指能生活在折磨当中。正是因此，巫师拥有比伦诺克斯更加灵活的能力。他们没有伦诺克斯那样实体的束缚，因此有更为强大的法力。除了星光之首的伦诺克斯，没有人能抵抗他们。而魔影，就是由巫师们所释放的一种能缠人心智的法术。它能够让……Tdl念到一半，门外传来了局促地脚步声，两个强壮的小伙子冲进了远古传说藏书区，指着Tdl说：“快点交钱，不然滚！”Tdl看到他们，先是一怔，然后反应过来自己没带钱，最后利用最后的一点时间把羊皮纸塞进背包，拉着Elc就往前跑，一个猛子从两个管理员中间穿过去，飞奔出了图书馆。“唉，不至于！我带钱了，好好商量不行吗，大不了羊皮纸接几天再还。”Elc甩开Tdl的手，从兜里找出了两个铜板，给了管理员。但管理员却说：“给钱也不行。前两天欧瑞克领主大人下令封锁了所有图书馆的远古传说藏书区。现在钱还给你们，羊皮纸留下。赶紧走！”他把铜板还给Elc，大步走回了图书馆。Tdl无奈的甩了甩脑袋，拉着Elc走了。深夜，Tdl突然醒来，他拍了拍Elc把他也整醒，说：”咱们明天早上就出发，我要报仇。”第二天早上，Tdl和Elc就与房东道别，离开了欧瑞克。“抓紧你的飞兽，记住了，这回的旅程回很长，也会很快。”Elc对Tdl说。“大概多少天？”“快的话一天左右就可以。”Elc回答，“但是这样就没时间吃饭了。”“好吧，多带点吃的路上吃算了。”Tdl报仇心切，顾不得那么多了。这一路上Tdl没有说话，想象着如何替父报仇。既然能kill他父亲，说明这个人实力很强，恐怕单凭Tdl一人难以对付，因此Tdl希望Elc帮助自己。“Elc，我们要面对的敌人很强大，到时候你需要帮助我，懂吗？”Tdl问。“明白，”Elc说，“我不会置之不理的。Tco在我小时候是大名鼎鼎的善人，曾一度将萨鲁曼德森林过度建设的十分美好。但我不知道为什么他会堕落，总之自从我离家出走，就再也没听说过他的消息。但他的实力不容小觑，恐怕有我咱们也会十分艰难。”“没事，背后偷袭。可我总觉得有点奇怪，你有没有觉得那个法师好像和笔记里描写的堕落伦诺克斯很相似？”Tdl抿着嘴唇。“是，我也这么想。但艾克赛特可是Sr推荐的人，还不能信任吗？”Elc想了想说。Tdl陷入了沉思。最后，他点了点头，信了艾克赛特一回。Tdl不再说话，趴在飞兽上闭上了眼睛，等他睁开眼睛时，天已经黑透了，他也意识到自己很饿。在空中草草吃完，不就Tdl就看见了在黑夜中散发着紫色幽光的格兰陵。七棵镶嵌着映光石的不规则花岗石柱将一个方圆百里的原型白色平台包裹其中，平台上又有一个小型圆台，上面雕刻着象征古代星光的花纹，正式祭祀场所。如果你见过巨石阵，不难想象它的样子。Tdl突然感觉到了另一股强大的精神力，与法师相似，但有所不同。Tdl和Elc指导飞兽降落在了平台上，喂了它们一点肉干，然后顺着圆台旁边的楼梯走了下去。绕过第3根柱子，是一个开阔的小林地，里面种满了松柏杉这样的裸子植物。Tdl点起了油灯。二人环顾四周，缓缓走进了黑暗的树林。不就他们果然看到了一个茅草房子，从窗户向外散着明亮的灯光。Tdl和Elc对视了一眼，点了点头。Elc径直走到了茅草屋门口，敲了敲门。过了一会，门开了，面前站着一个身穿黑袍，斗篷遮脸的人。“你们好，久等了。” VII The Story Of TcoTdl怔了一下，他不知所措的跟着Elc进了屋。计划完全被打乱了，只能出其不意，偷袭Tco。于是Tdl走进屋子后，接着上厕所的原有偷偷靠近Tco，在Tco为Elc倒水的时候伺机偷袭Tco。可没想到他身后的门突然打开了，他赶忙收起剑，然后根门里面走出来的人行了个礼。可他万万没想到眼前这个人竟然长得和Elc一模一样。“嘿，怎么了有客人来了是吗？”那个奇异的人问Tco。“嗯，你先回屋一下，我有点事情要说。”Tco回答。“OMG！老哥你怎么在这里！”Elc看到他突然站了起来，那人转过头，挑了一下眉毛，然后转身回屋了。Tdl心里暗想：机会到了！他趁Tco转头之际，缓缓靠近他，手中的长剑即将插入Tco的脖子……这一刻，Tdl五味杂陈。他想到了许多，想到了他不曾见到的那个夜晚，就是眼前这个人夺取了他的父亲；也想到了他为了自己的野心曾试图挑战安德森的王权；想到了为他而亖的Sr……这一刻，他终于等来了……吗？就在Tdl的长剑即将碰到Tco的一刹那，Tco飞速地抽剑转身一个剑花打掉了Tdl手中的长剑。Tdl惊慌失措，已经做好了像父亲那样赴亖的准备，可谁知Tco却长叹了一声：“唉……看来我还是晚了一步。他们已经跟你说了……”Tco摘下了头上的兜帽，露出了一张满是沧桑的脸。“看着我干嘛，我很好看吗？去坐下吧。”Tco对Tdl说，Tdl愣住了，然后缓缓坐到了沙发上。“在找我之前，你们已经去过欧瑞克了，对吧？法师也对你说了你爸的身份？当然他说的不能完全信。是谁告诉你我是你仇人的？”Tco问。“艾克赛特公爵。”Tdl说。“好家伙，老头子怎么也叛变了……好吧。你们愿意相信我吗？”Tco问。Tdl没有说话，他转头看向Elc，Elc摇了摇头。“我需要你证明你是正确的。”Elc说。“Tdl，我将跟你讲述魔影的故事。”Tdl说，随即掏出了那份被管理员拿走的笔记（的副本）。“完整的故事是这样的：”巫师们为了在人间树立自己的形象，释放了一种名叫“魔影”的法术，它能够迷惑人的心智，让人感到幸福与满足。这样，人们就会不约而同地认为他们的统 治者——安德森王国的国王和法师们为他们带来了美好，也就没人愿意谋反了。不过伦诺克斯是免疫这种干扰的，而且因为法师们对人性的了解不够深刻，所以即便是有些普通人，也能够通过强大的意志摆脱干扰。可毕竟那只是少数，而且法师人数众多，所以自从埃普卢尔1600年开始，法师们的政 权就从来没有动摇过。当然，他们或许做的未必是错事，关键是诱惑他们的人。“我的伦诺克斯同胞就是被法师抓走的，然后通过一些诱惑，使他们全部堕落。现在，你愿意相信我了吗？”Tco说完了。Tdl再次想起了艾克塞特公爵的异样以及法师的形象，终于，他说：“好吧，我愿意相信你。可你真的是我的杀父仇人吗”“当然不是，结果你父亲的，不是别人，是他自己。他在将你托付给Sr之后，受到魔影的干扰，zs了。”Tco惨淡地笑了一下。“可怜的老家伙。”“你是怎么知道这么多的？”Tdl问。“我是他曾经的朋友。想知道他儿时的名字吗？我告诉你，他叫Mrs。”Tco缓缓地说。“那你能跟我们讲讲你的故事吗？”Tdl问。“好吧，既然你们这么问，我也不好意思不说啊……”Tco也是一名伦诺克斯（听到这里Elc再次一怔），他儿时就展现出了自己的能力。那个下午，Tco独自一人回到了家。第二天，他就和Mrs离开了家乡。具体为什么，谁也不知道。可神奇的是，第二天一早，人们就发现了躺在家中神智不清的Emr。没几天，Emr就在医院里神秘趋势了。Tco找人将Mrs带到了弩门诺尔，受到当时的帝王的庇护，然后自己一人踏上了逃亡旅程。为什么要逃亡？待会你就知道了。这一逃就是两年。所幸一切相安无事，Tco在乌顿安定了下来，小日子过得不错。而事故，就发生在17年前的一个夜里，那年，Tco20岁。那天晚上，Tco照常来到乌顿古兰忒儿的一间酒馆里，和来看望他的Mrs聊天。“怎么样，最近他们没有来找过你吧？”Mrs问。“没有，但快了。我劝你不要在这里久留，最好今晚就走。”Tco抿了一口啤酒，缓缓说。“我觉得不至于。多一个人，不好吗？”Mrs笑了笑。“不是我想贬低你，但恕我直言，这件事你不会对我有什么帮助。”Tco苦笑了一下，看到了Mrs失望的眼神。但最后Mrs还是说：“好吧，既然这样，我就先走了。”然后递给服务员一沓钱，转身离开了酒馆。Tco长叹一声，握住了腰间的剑。果然，不出Tco所料，他前脚刚出门，周围就围上了一群黑衣人，他们二话不说，上来就举起长剑。霎时，几十把长剑对准了Tco的前胸后背，不留一点喘息的机会，眼看Tco就要被吞噬。但Tco却十分平静，只见他双眼变幻成了紫色，猛的一下，周围的一切都消失了，一个带着面具的身影出现在了Tco面前。从面具人颤抖的手上可以看到一枚巨大的钢钉，刺穿了他的手臂，却仍然能活动。一个低沉沙哑的声音从面具里传了出来：“来吧，聪慧的智者，加入我们，我能给你想要的一切。”Tco依旧面不改色：“你的演技，怕不是成功了几千次，却败在了我手下一次。”“你怎么会……？”黑面具人显得十分惊恐。“我？你知道你的手下都是谁吗？他们都曾是我的朋友。”Tco静静地说。面具人没有说话。随后他打了个响指，四五个黑衣人凭空出现，他们一起施法，创造出了一个紫色超立方体，困住了Tco。“你想要干什么！”Tco大叫。“你的实力太强了，既然不能为我所用，那么……”“呃……！”Tco奋力反抗，想要强行将自己周围的法师都干掉，这样超立方体失去控制，就消散了。这是唯一的方法，但毕竟自己一个伦诺克斯对付的可是一群法师，他们没有实体的限制，法力高强。总是Tco拼命挣脱，奈何，终究是被超立方体困入其中，带到了欧尔克圣殿。“彭！”管理者关上了牢笼的大门，Tco被死死捆住，动弹不得。而且每时每刻都有哨兵围在周边，一旦他有施法的迹象，就会万箭齐发，然后碎亖万段。Tco该如何应对呢？预知后事如何，看下一章你是得不到答案的。因为这一章还没结束。在牢里关起来真不好受。就算是晚上被松了绑，他也无聊至极。就这样被关了10天。第十一天早上，Tco草草吃完早饭，想要点纸和笔写写东西，但他连站起来的力气都没有了。于是Tco睡了一觉，一觉睡了一整天。他梦到了Mrs，梦到了自己的朋友们，梦到了格兰陵的风光……还梦到了……Tdl？他当时还不认识这个孩子，也没有把他当回事。然后，他又梦到了Mrs，梦到了他帮助自己度过难关的时刻。突然，Tco意识到了什么，他猛地睁开眼，对上了蒙面守卫面具下隐藏的眼睛……那是Mrs特有的眼神……“冷静，这只是梦境……冷静……他不可能……”Tco大惊，尽力的劝说自己的内心，希望这一切不是真的。于是，又担惊受怕了一天。深夜，Tco被嘎吱嘎吱的声音吵醒了，睁眼一看，是个守卫在点烟。Tco不耐烦地跺了一脚，不慎被守卫听到了。然而守卫并没有像往常一样刁难他，而是熄灭了手中的烟斗。Tco心理感觉不对劲。他再一次对上了守卫的眼睛。没错，是Mrs没错了，自己也确实不在梦里。那么……？Tco立刻掏出了那枚金色徽章，听到了Mrs想对他说的话：我是来帮你的，想办法自己挣脱绳索，我趁机把其他守卫干掉。我知道一个密道，可以逃走。快！三，二，一……Go！说时迟那时快，Tco浑身燃起了星光般闪耀的火焰，绳索稀疏崩离。其他几个守卫立刻掏出了弩箭，对准了Tco。没等他们反应过来，Mrs就用苦练二十年的剑术瞬间击杀了他们。他从守卫头子的裤子里掏出钥匙，打开了Tco牢房的门和手铐，带着Tco顺着通风管道离开了牢房。走到一半，Tco突然发现通风管道下面好像有人盯着自己，他悄悄往下一看，正对上了从空隙里死死盯着他的法师之首的血红的眼睛。随即，Mrs和Tco都掉到了地上，管道被炸的粉碎。“既然你死心不改，那今天，就做个了断吧！”法师一把抓住了Mrs，拔出剑，对准了Mrs的脖子。","categories":[{"name":"Novel","slug":"Novel","permalink":"https://allen2010.github.io/categories/Novel/"}],"tags":[{"name":"fantasy","slug":"fantasy","permalink":"https://allen2010.github.io/tags/fantasy/"}]},{"title":"Animator vs. Animation 浅谈","slug":"AvA","date":"2025-04-18T10:51:39.000Z","updated":"2025-04-18T12:09:51.656Z","comments":true,"path":"2025/04/18/AvA/","permalink":"https://allen2010.github.io/2025/04/18/AvA/","excerpt":"The Secret that was buried in Animator vs. Animation.","text":"Intro","categories":[{"name":"Essay","slug":"Essay","permalink":"https://allen2010.github.io/categories/Essay/"}],"tags":[{"name":"animate","slug":"animate","permalink":"https://allen2010.github.io/tags/animate/"},{"name":"alan becker","slug":"alan-becker","permalink":"https://allen2010.github.io/tags/alan-becker/"},{"name":"original","slug":"original","permalink":"https://allen2010.github.io/tags/original/"}]},{"title":"Animation vs. Minecraft 浅谈","slug":"AvM","date":"2025-04-14T14:55:05.000Z","updated":"2025-05-19T13:31:50.970Z","comments":true,"path":"2025/04/14/AvM/","permalink":"https://allen2010.github.io/2025/04/14/AvM/","excerpt":"Something about Animation vs. Minecraft I want to tell you.","text":"IntroAnimation vs. Minecraft 是由美国动画师 Alan Becker 绘画的一系列动画短片。它分为四个季度（第四季仍在更新）。 其中前两季（Ep 1-19）和新集第四季（Ep 31-?）是动画主人公们与 Minecraft 的不连续的种种经历，而第三季（Ep 20-30）则是一个完整的故事线。它讲述的是由橙王（King Orange）和紫色（Purple）引发的一系列复仇和主人公们（The Second Coming, Blue, Red, Yellow, Green）与之对抗的故事，从蓝色前往寻找地狱疣被女巫捉住，其他四人前去营救从而遇到紫色开始，到橙王突然领悟真谛释然后悔，再临恢复世界结束。 Characters AvM. Characters Episodes Plot AvM. Episodes Plot Episodes List AvM. Episodes List Analysis可以注意到…… To Be Continue…… The End","categories":[{"name":"Essay","slug":"Essay","permalink":"https://allen2010.github.io/categories/Essay/"}],"tags":[{"name":"animate","slug":"animate","permalink":"https://allen2010.github.io/tags/animate/"},{"name":"alan becker","slug":"alan-becker","permalink":"https://allen2010.github.io/tags/alan-becker/"},{"name":"original","slug":"original","permalink":"https://allen2010.github.io/tags/original/"}]},{"title":"Best Badminton Player","slug":"Badminton","date":"2025-04-03T09:32:05.000Z","updated":"2025-04-14T12:06:12.106Z","comments":true,"path":"2025/04/03/Badminton/","permalink":"https://allen2010.github.io/2025/04/03/Badminton/","excerpt":"Here's the ranking of the Best Badminton Player in my mind.","text":"Here RankingHere’s the ranking of the Best Men’s Singles Badminton Player in my mind. 这里是一个我认为的羽球男单著名选手排名 No.1 Lin Dan林丹，中国前羽毛球运动员。最高排名世界第一位，因其球风凶悍、个性鲜明，于2004年全英赛击败丹麦选手彼得·盖德夺冠后，被对方称为 Super Dan。林丹被公认为同时代实力最强的羽毛球运动员，被誉为羽毛球历史上最伟大的球员。他与马来西亚华裔球手李宗伟的多次对决也被誉为男单史上最高水准对决，被球迷称为“林李大战”。 Wiki-林丹 No.2 Lee Chong Wei拿督威拉李宗伟，马来西亚华人运动员，已退役的羽毛球男子单打运动员，被称为“大马羽毛球一哥”，作为男单运动员，李宗伟在2008年8月21日成为国际羽联世界排名第一的球手。 Wiki-李宗伟 No.3 Chen Long谌龙，中国退役男子羽毛球运动员，于2016年里约奥运会羽毛球项目男子单打取得金牌。技术特点为擅于防守反击、突击爆发力强。现为中国国家青年羽毛球队教练。 Wiki-谌龙 No.4 Taufik陶菲克·希达亚特（印尼语：Taufik Hidayat），印尼男子羽毛球运动员，他与丹麦的彼得·盖德、中国的林丹和马来西亚的李宗伟并称国际羽坛四大天王。 Wiki-陶菲克 No.5 Viktor Axelsen维克托·阿克塞尔森（丹麦语：Viktor Axelsen），汉名安赛龙，丹麦羽毛球男子单打运动员。安赛龙是丹麦历史上首位世青赛男单冠军。2021年8月，他在东京奥运羽毛球单打决赛中以2比0击败谌龙，成为自2004年奥运以后首位夺得羽毛球男单冠军的非中国球员。 Wiki-安赛龙 No.6 Kento Momota桃田贤斗（Kento Momota），日本羽毛球男子单打运动员，日本首位男单羽毛球世锦赛冠军、卫冕者及世界排名第一的男子单打选手。 Wiki-桃田贤斗 注：关于安赛龙和桃田的排名问题 由于桃田在比赛中击败安赛龙的次数远高于败于他的次数，可能会引起为何安赛龙排名比桃田高的疑虑。首先，这是个人排名，也就是我自己心中一个羽毛球男单运动员的实力排名。桃田由于不可控因素，统治羽球界的时间比安赛龙短。且我认为人品也是评价运动员实力的因素，而桃田曾因违反规定而被禁赛，自然在我心中形象会有所降低。不过桃田也确实是个正人君子，这点需要明确。其次，其实排名 5-7 名的界限并不是很明确，我都是跟着第一感觉来的，也没有必要较汁了。 No.7 Peter Gade彼得·盖德（丹麦语：Peter Gade），丹麦退役男子羽毛球单打运动员，与印尼的陶菲克、中国的林丹和马来西亚的李宗伟并称国际羽坛“四大天王”。他的选手生涯之长冠绝当年羽坛，因此又被人称为羽坛“常青树”，并曾经缔造连续62周排名世界第一的纪录。 Wiki-彼得·盖德 No.8 Shi Yu Qi 淡黄的长裙…… 石宇奇，中国羽毛球男子单打运动员。 Wiki-石宇奇 No.9 Lee Zii Jia李梓嘉（英语：Lee Zii Jia），马来西亚男子羽毛球运动员。2024年巴黎奥运会羽毛球男单铜牌获得者。 Wiki-李梓嘉 AchievementMajor events only. Olympic Games奥林匹克夏季运动会 Olympic 夏季奥运会奖牌 BWF World Championships世界羽毛球锦标赛 BWF 世锦赛 All England全英羽毛球公开锦标赛（All England Open Badminton Championships） All England 全英公开赛 Gallery","categories":[{"name":"Favourite","slug":"Favourite","permalink":"https://allen2010.github.io/categories/Favourite/"}],"tags":[{"name":"badminton","slug":"badminton","permalink":"https://allen2010.github.io/tags/badminton/"},{"name":"personal thought","slug":"personal-thought","permalink":"https://allen2010.github.io/tags/personal-thought/"}]},{"title":"Segment Tree 线段树笔记","slug":"Segment Tree","date":"2025-03-21T16:00:00.000Z","updated":"2025-04-06T12:02:51.608Z","comments":true,"path":"2025/03/22/Segment Tree/","permalink":"https://allen2010.github.io/2025/03/22/Segment%20Tree/","excerpt":"区间求和与最值等区间问题在算法竞赛中扮演着重要的一环。而其中伴随的区间修改，便需要用线段树来解决。","text":"算法描述 线段树常用于解决区间修改查询问题，包括但不限于最大值、最小值和求和。线段树最大的难点，就是你不知道它将用来解决怎样的问题。 定义线段树就是一棵普普通通的树，它的大部分节点都有两个子节点，但并不是一棵满二叉树，也不是完全二叉树。这一点你在学习后面的文章后就会明白了。线段树上每一个节点都代表着一段区间，而每个子结点代表的区间长度都是其父节点的一半。若长度是奇数则会有些许偏差。而节点的值则是这个区间的需求。 应用线段树可以解决大部分的区间问题，只要你能想清楚怎么分治，基本上就是线段树没得跑。哪怕这个区间的需求是连续的。通常来说，线段树的操作分为以下几种： 建树：输入数组并建立对应需求的线段树 单点修改：将 位置的元素改成 区间修改：将 到 位置的所用元素改成或增加 区间查询：查询 到 区间内的最大/最小/和/其他需求 算法实现线段树用数组实现。注意数组大小要开到 。左右子树的编号分别是 和 。12ll lc(ll p){return p &lt;&lt; 1;}ll rc(ll p){return p &lt;&lt; 1 | 1;} 初始化从根节点开始，不断的分割区间直到该区间只剩单个数，然后开始向上汇总。传入两个变量 l 和 r， 表示当前节点表示的线段。1234567891011121314void pushUp(ll p){ sum[p] = sum[lc(p)] + sum[rc(p)];}void build(ll p, ll l, ll r){ if(l == r){ sum[p] = a[l]; return; } ll mid = (l + r) &gt;&gt; 1; build(lc(p), l, mid); build(rc(p), mid + 1, r); pushUp(p); } 区间查询从根节点开始，如果当前的线段不被查询的区间完全包含就一直分两段尝试，直到它被完全包含了，返回该线段的值然后继续递归其他的。1234567891011121314ll Query(ll p, ll l, ll r, ll ql, ll qr){ if(ql &lt;= l &amp;&amp; qr &gt;= r){ return sum[p]; } pushDown(p, l, r); ll mid = (l + r) &gt;&gt; 1, ans = 0; if(ql &lt;= mid){ ans += Query(lc(p), l, mid, ql, qr); } if(qr &gt; mid){ ans += Query(rc(p), mid + 1, r, ql, qr); } return ans;} 区间修改如果每次修改都从上到下全改一遍，复杂度得 ，太浪费时间了，完全体现不出线段树的优势所在。因此引入懒标记（Lazy Tag）。和查询一样，当线段被区间完全覆盖时，对应的节点自己更新，但它的孩子们不更新。这时给他安上一个懒标记，表示它的子节点需要更新的大小。当区间没有完全覆盖，需要拆分的时候，将当前变量的标记拆掉，传给子节点，这样才不会错算。12345678910111213141516void Update(ll p, ll l, ll r, ll ql, ll qr, ll d){ if(ql &lt;= l &amp;&amp; qr &gt;= r){ sum[p] += d * (r - l + 1); tag[p] += d; return; } pushDown(p, l, r); ll mid = (l + r) &gt;&gt; 1; if(ql &lt;= mid){ Update(lc(p), l, mid, ql, qr, d); } if(qr &gt; mid){ Update(rc(p), mid + 1, r, ql, qr, d); } pushUp(p);} 例题例题：Luogu P3372123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869#include &lt;iostream&gt;#include &lt;algorithm&gt;using namespace std;typedef long long ll;const int MAXN = 1e5 + 5;ll segt[4 * MAXN], tag[4 * MAXN], a[MAXN];ll lc(ll p){return p &lt;&lt; 1;}ll rc(ll p){return p &lt;&lt; 1 | 1;}void pushUp(ll p){ segt[p] = min(segt[lc(p)], segt[rc(p)]);}void build(ll p, ll l, ll r){ if(l == r){ segt[p] = a[l]; return; } ll mid = (l + r) &gt;&gt; 1; build(lc(p), l, mid); build(rc(p), mid + 1, r); pushUp(p);}void moveTag(ll p, ll k){ tag[p] += k; segt[p] += k;}void pushDown(ll p){ moveTag(lc(p), tag[p]); moveTag(rc(p), tag[p]); tag[p] = 0;}void Update(ll p, ll l, ll r, ll ql, ll qr){ if(ql &lt;= l &amp;&amp; qr &gt;= r){ moveTag(p, 1); return; } pushDown(p); ll mid = (l + r) &gt;&gt; 1; if(ql &lt;= mid)Update(lc(p), l, mid, ql, qr); if(qr &gt; mid)Update(rc(p), mid + 1, r, ql, qr); pushUp(p);}ll Query(ll p, ll l, ll r, ll ql, ll qr){ if(ql &lt;= l &amp;&amp; qr &gt;= r){ return segt[p]; } pushDown(p); ll mid = (l + r) &gt;&gt; 1, ans = 2147483647; if(ql &lt;= mid)ans = min(ans, Query(lc(p), l, mid, ql, qr)); if(qr &gt; mid)ans = min(ans, Query(rc(p), mid + 1, r, ql, qr)); return ans;}int main(){ ll n, m; cin &gt;&gt; n &gt;&gt; m; for(ll i = 1; i &lt;= n; i ++){ cin &gt;&gt; a[i]; } build(1, 1, n); while(m --){ ll opt, l, r; cin &gt;&gt; opt &gt;&gt; l &gt;&gt; r; if(opt == 1){ Update(1, 1, n, l, r); }else{ cout &lt;&lt; Query(1, 1, n, l, r) &lt;&lt; \"\\n\"; } } return 0;} 变种区间和并在遇到有区间连续的需求时，我们发现传统线段树并不适用，因为分段时无法控制答案的范围，在向上整理回父节点时可能会遇到答案的中间部分没有连接但却错误转移的情况。我们可以定义额外的变量存于线段树的数组，分别表示了以区间最左边和最右边起始的答案，这样就只需要思考如何 pushUp 转移了。 例题例题：区间最大连续子序列和输入一个长度为 的数组 ，数组的元素均为整数且满足 。对该数组可以发出 条指令。指令共有 种： 1 x v，该指令将 的值修改为 2 l r，该指令查询区间 到 的最大连续子序列和，即区间所有可能的连续子序列中求和的最大值 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374#include &lt;iostream&gt;#include &lt;algorithm&gt;#include &lt;climits&gt;using namespace std;typedef long long ll;const ll MAXN = 400005, fINF = LONG_LONG_MIN;struct Node{ ll sum = 0, lans = fINF, rans = fINF, ans = fINF;}segt[4 * MAXN];ll a[MAXN];ll lc(ll p){return p &lt;&lt; 1;}ll rc(ll p){return p &lt;&lt; 1 | 1;}void pushUp(ll p){ segt[p].sum = segt[lc(p)].sum + segt[rc(p)].sum; segt[p].lans = max({segt[lc(p)].sum + segt[rc(p)].lans, segt[lc(p)].lans}); segt[p].rans = max({segt[rc(p)].sum + segt[lc(p)].rans, segt[rc(p)].rans}); segt[p].ans = max({segt[lc(p)].rans + segt[rc(p)].lans, segt[lc(p)].ans, segt[rc(p)].ans});}void build(ll p, ll l, ll r){ if(l == r){ segt[p].ans = segt[p].lans = segt[p].rans = segt[p].sum = a[l]; return; } ll mid = (l + r) &gt;&gt; 1; build(lc(p), l, mid); build(rc(p), mid + 1, r); pushUp(p);}void Update(ll p, ll l, ll r, ll x, ll v){ if(l == r){ segt[p].sum = segt[p].ans = segt[p].lans = segt[p].rans = v; return; } ll mid = (l + r) &gt;&gt; 1; if(x &lt;= mid)Update(lc(p), l, mid, x, v); else if(x &gt; mid)Update(rc(p), mid + 1, r, x, v); pushUp(p);}Node Query(ll p, ll l, ll r, ll ql, ll qr){ if(ql &lt;= l &amp;&amp; qr &gt;= r){ return segt[p]; } ll mid = (l + r) &gt;&gt; 1; if(ql &lt;= mid &amp;&amp; qr &gt; mid){ Node ans, qla = Query(lc(p), l, mid, ql, qr), qra = Query(rc(p), mid + 1, r, ql, qr); ans.sum = qla.sum + qra.sum; ans.ans = max({ans.ans, qla.ans, qra.ans, qla.rans + qra.lans}); ans.lans = max({ans.lans, qla.lans, qla.sum + qra.lans}); ans.rans = max({ans.rans, qra.rans, qra.sum + qla.rans}); return ans; }else if(ql &lt;= mid){ return Query(lc(p), l, mid, ql, qr); }else{ return Query(rc(p), mid + 1, r, ql, qr); }}int main(){ ll n, m; cin &gt;&gt; n &gt;&gt; m; for(ll i = 1; i &lt;= n; i ++){ cin &gt;&gt; a[i]; } build(1, 1, n); while(m --){ ll opt, l, r; cin &gt;&gt; opt &gt;&gt; l &gt;&gt; r; if(opt == 1){ Update(1, 1, n, l, r); }else{ cout &lt;&lt; Query(1, 1, n, l, r).ans &lt;&lt; \"\\n\"; } } return 0;} 总结极为常用，需要会用、会推、会写且达到熟练的地步。复杂度 ，已经很快了。","categories":[{"name":"Note","slug":"Note","permalink":"https://allen2010.github.io/categories/Note/"}],"tags":[{"name":"algorithm","slug":"algorithm","permalink":"https://allen2010.github.io/tags/algorithm/"},{"name":"data structure","slug":"data-structure","permalink":"https://allen2010.github.io/tags/data-structure/"},{"name":"divide & conquer","slug":"divide-conquer","permalink":"https://allen2010.github.io/tags/divide-conquer/"}]},{"title":"SketchUp Works Ep.1","slug":"Sketch1","date":"2025-03-09T13:05:05.000Z","updated":"2025-05-03T02:57:53.317Z","comments":true,"path":"2025/03/09/Sketch1/","permalink":"https://allen2010.github.io/2025/03/09/Sketch1/","excerpt":"Here's some of my most beautiful SketchUp works!","text":"Intro这是一些我用 Sketch Up 设计的、用 Twinmotion 渲染的建筑预览图！设计新手，有诸多缺陷，望见谅 Sunny day Rainy day Before sunrise","categories":[{"name":"Works","slug":"Works","permalink":"https://allen2010.github.io/categories/Works/"}],"tags":[{"name":"sketch","slug":"sketch","permalink":"https://allen2010.github.io/tags/sketch/"},{"name":"design","slug":"design","permalink":"https://allen2010.github.io/tags/design/"}]},{"title":"LCA 最近共同祖先算法笔记","slug":"Lowest Common Ancestor","date":"2024-12-20T16:00:00.000Z","updated":"2025-04-14T13:25:18.419Z","comments":true,"path":"2024/12/21/Lowest Common Ancestor/","permalink":"https://allen2010.github.io/2024/12/21/Lowest%20Common%20Ancestor/","excerpt":"对于一棵树上任意两个节点的最近共同祖先问题，能否用倍增法解决？","text":"算法描述 恐龙，是指三角龙、现代鸟类和梁龙的最近共同祖先 (LCA) 及其所有后代。 ——百度百科 假设有一棵树，上面有两个节点，求两个节点最近的共同祖先节点。也可以理解为包含这两个节点的子树是从什么时候分开的。 算法思路 一生二，二生四，四生万物。 ——泥土笨笨 采用倍增的思想，将查询最近共同祖先问题分成若干部： 预处理预处理一个数组 anc[i][j] 表示 节点的 号祖先的编号。其中有 anc[i][j] = anc[anc[i][j - 1]][j - 1]; 意思是 的 祖先就是 的 的祖先的 祖先。通过这个式子就可以转移了。转移过程中同时预处理 数组表示深度，后面会用到。123456789101112void dfs(ll u, ll father){ //该节点和它的父亲节点 dep[u] = dep[father] + 1; //预处理深度 anc[u][0] = father; //i 的 第一个祖先，即父亲。 for(ll i = 1; (1 &lt;&lt; i) &lt;= dep[u]; i ++){ anc[u][i] = anc[anc[u][i - 1]][i - 1]; //转移，由于是从小到大枚举的j，所以当前的anc转移一定是正确的 } for(ll i = head[u]; i; i = pool[i].next){ //往下递归 if(pool[i].v != father){ dfs(pool[i].v, u); } }} 调整深度追平深度。顾名思义，通过不断调整深度让需要查询的两个节点深度相等。123456if(dep[x] &lt; dep[y]){ swap(x, y);}while(dep[x] &gt; dep[y]){ x = anc[x][lg[dep[x] - dep[y]] - 1];} 跳跃结算一起往上调，跳的步数从 步开始不断尝试，如果调完了发现重合，就放弃，然后尝试少跳一点，以此类推。直到最后到达了最接近共同祖先的位置，即共同祖先的孩子节点。为什么重合要放弃？因为谁也没办法保证当前的重合点是最近的，要不断尝试下调就太麻烦了。12345678if(x == y)return x;for(ll i = lg[dep[x]]; i &gt;= 0; i --){ if(anc[x][i] != anc[y][i]){ x = anc[x][i]; y = anc[y][i]; }}return anc[x][0]; 总代码例题：洛谷 P3379 【模板】 最近公共祖先（LCA）12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667#include &lt;iostream&gt;#include &lt;algorithm&gt;#include &lt;cmath&gt;using namespace std;typedef long long ll;const ll MAXN = 500005;struct Node{ ll v, next;}pool[2 * MAXN];ll anc[MAXN][25], dep[MAXN], head[MAXN], nn, lg[MAXN];ll n, m, s;void addEdge(ll u, ll v){ pool[++nn].v = v; pool[nn].next = head[u]; head[u] = nn;}void dfs(ll u, ll father){ dep[u] = dep[father] + 1; anc[u][0] = father; for(ll i = 1; (1 &lt;&lt; i) &lt;= dep[u]; i ++){ anc[u][i] = anc[anc[u][i - 1]][i - 1]; } for(ll i = head[u]; i; i = pool[i].next){ if(pool[i].v != father){ dfs(pool[i].v, u); } }}ll lca(ll x, ll y){ if(dep[x] &lt; dep[y]){ swap(x, y); } while(dep[x] &gt; dep[y]){ x = anc[x][lg[dep[x] - dep[y]] - 1]; } if(x == y)return x; for(ll i = lg[dep[x]]; i &gt;= 0; i --){ if(anc[x][i] != anc[y][i]){ x = anc[x][i]; y = anc[y][i]; } } return anc[x][0];}int main(){ cin &gt;&gt; n &gt;&gt; m &gt;&gt; s; for(ll i = 1; i &lt;= n - 1; i ++){ ll x, y; cin &gt;&gt; x &gt;&gt; y; addEdge(x, y); addEdge(y, x); } for(ll i = 1; i &lt;= n; i ++){ lg[i] = lg[i - 1] + ((1 &lt;&lt; lg[i - 1]) == i); } dfs(s, 0); for(ll i = 1; i &lt;= m; i ++){ ll x, y; cin &gt;&gt; x &gt;&gt; y; cout &lt;&lt; lca(x, y) &lt;&lt; \"\\n\"; } return 0;}","categories":[{"name":"Note","slug":"Note","permalink":"https://allen2010.github.io/categories/Note/"}],"tags":[{"name":"algorithm","slug":"algorithm","permalink":"https://allen2010.github.io/tags/algorithm/"},{"name":"binary lifting","slug":"binary-lifting","permalink":"https://allen2010.github.io/tags/binary-lifting/"}]},{"title":"Sparse Table ST表笔记","slug":"Sparse Table","date":"2024-11-09T16:00:00.000Z","updated":"2025-04-14T13:25:29.770Z","comments":true,"path":"2024/11/10/Sparse Table/","permalink":"https://allen2010.github.io/2024/11/10/Sparse%20Table/","excerpt":"区间贡献问题的另一种更简单、更快捷的解决方案。","text":"问题叙述 RMQ 是 Range Maximum/Minimum Query 的缩写，表示可重复贡献的区间最大/最小值。 显而易见的，可以用线段树实现。但是由于该问题不涉及修改操作，且线段树太长了不好写，十分浪费时间。 这是就需要用到好理解又好写的ST表了。 算法思路 ST表(Sparse Table)是用于解决可重复贡献问题的数据结构。 倍增思想：我们考虑将 定义为 起点为 , 到 位置的所有元素的最大值。例如 表示 和 中的最大值。 转移过程把当前区间拆成两个大小相等的区间，用动态规划求出答案。 st_{i,j} = max(st_{i,j - 1},st_{i + 2^{j-1},j - 1})这样就可以保证该区间内所有的元素都被转移了。预处理就是将 表示第 个元素的最大值，即本身。 查询过程查询过程也一样，分成两个区间，这里我用的是 和 ，因为这样刚好有一部分重叠，可以保证答案转移的正确性，然后分别求最大值最后在汇总一下。 max(st_{l,k}, st_{r - 2^k + 1,k})其中的 k = log[r - l + 1]，用于分隔两个区间。至于怎么求 ，这里我用的是传统求 lg[i] + 1 的写法，见下方代码。 总代码例题：洛谷 P3865【模板】ST 表 &amp;&amp; RMQ 问题12345678910111213141516171819202122232425262728293031323334353637#include &lt;iostream&gt;#include &lt;algorithm&gt;#include &lt;queue&gt;using namespace std;typedef long long ll;const ll MAXN = 1e5 + 5;ll st[MAXN][25], lg[MAXN];ll Query(ll l, ll r){ ll k = lg[r - l + 1] - 1; return max(st[l][k], st[r - (1 &lt;&lt; k) + 1][k]);}int main(){ ios::sync_with_stdio(false); cin.tie(0); cout.tie(0); ll n, m; cin &gt;&gt; n &gt;&gt; m; for(ll i = 1; i &lt;= n; i ++){ cin &gt;&gt; st[i][0]; } for(ll i = 1; i &lt;= n; i ++){ lg[i] = lg[i - 1] + ((1 &lt;&lt; lg[i - 1]) == i); } for(ll j = 1; j &lt;= 20; j ++){ for(ll i = 1; i + (1 &lt;&lt; j) - 1 &lt;= n; i ++){ st[i][j] = max(st[i][j - 1], st[i + (1 &lt;&lt; (j - 1))][j - 1]); } } while(m --){ ll l, r; cin &gt;&gt; l &gt;&gt; r; cout &lt;&lt; Query(l, r) &lt;&lt; \"\\n\"; } return 0;} 更多思考 为什么 ST表 似乎很少被用于区间求和之类的问题？ 这个问题看起来很傻，却很有用。大概有如下两个原因： 可以用前缀和，更好写还不容易错 ST表如果想要O(1)查询，需要满足所求的问题区间能够重复覆盖。因为查询是两边重叠算的啊 显然，对于第二点，区间求和并不满足条件（如果重复覆盖就会有许多值被加了多次）。那么可不可以进行二进制拆分呢？答案显然是可以的。","categories":[{"name":"Note","slug":"Note","permalink":"https://allen2010.github.io/categories/Note/"}],"tags":[{"name":"algorithm","slug":"algorithm","permalink":"https://allen2010.github.io/tags/algorithm/"},{"name":"binary lifting","slug":"binary-lifting","permalink":"https://allen2010.github.io/tags/binary-lifting/"},{"name":"data structure","slug":"data-structure","permalink":"https://allen2010.github.io/tags/data-structure/"}]},{"title":"Floyd 全源最短路径算法笔记","slug":"Floyd Path","date":"2024-10-12T16:00:00.000Z","updated":"2025-03-25T14:24:34.130Z","comments":true,"path":"2024/10/13/Floyd Path/","permalink":"https://allen2010.github.io/2024/10/13/Floyd%20Path/","excerpt":"多源最短路径最简单、最实用、最好理解，同时也是最慢的经典算法。","text":"算法描述 三个破变量，一共就十行。编程十分钟，运行一晚上。 很多人认为 Floyd 就是简单的动态规划，甚至有人直接把它当模板背了下来，导致不会变通而 WA 了 P1119。然而其实大多数初学者包括我一开始都理解错了它，包括原理。 算法实现定义 表示只包含前 个节点时 到 的最短路。而加不加入这个 号元素前后有什么区别呢？无非就是某两个点的最短路通过 号点松弛出了更有的最短路嘛。于是就有了经典代码：123456789void Floyd(){ for(ll k = 1; k &lt;= n; k ++){ for(ll i = 1; i &lt;= n; i ++){ for(ll j = 1; j &lt;= n; j ++){ dis[i][j] = min(dis[i][j], dis[i][k] + dis[k][j]); } } }}那么如何初始化呢？如果 到 有路，就初始化为边长。否则初始化为最大值。1234567for(ll i = 1; i &lt;= n; i ++){ for(ll j = 1; j &lt;= n; j ++){ if(i == j)dis[i][j] = 0; else if(gph[i][j])dis[i][j] = gph[i][j]; else dis[i][j] = INF; }}这就完了吗？这值得写博客吗？当然不值。虽然我本来就是给自己写来复习的 Floyd应用Floyd解决传递闭包问题题目传送门 在有向图中，定义 如果是 1，则表示 能到达 ，否则反之。 这该如何解决呢？转换一下定义。定义 表示只有前 个点时 能否到达 。同理，加入了一个元素 之后无非就是有一组 能通过它到达 了。 123456789101112131415161718192021void Floyd(){ for(ll i = 1; i &lt;= n; i ++){ for(ll j = 1; j &lt;= n; j ++){ if(graph[i][j])d[i][j] = 1; else d[i][j] = 0; } } for(ll k = 1; k &lt;= n; k ++){ for(ll i = 1; i &lt;= n; i ++){ for(ll j = 1; j &lt;= n; j ++){ d[i][j] = d[i][j] || (d[i][k] &amp;&amp; d[k][j]); } } } for(ll i = 1; i &lt;= n; i ++){ for(ll j = 1; j &lt;= n; j ++){ cout &lt;&lt; d[i][j] &lt;&lt; \" \"; } cout &lt;&lt; \"\\n\"; }} Floyd求最小环依旧是改定义： 为前 个节点中可以确定的最小环的大小。则匹配最短路，可以在算最短路之后算环了，可以理解为以 为一个顶点，由 可以到达的 和 以及 也就是最短路构成的环。然后枚举已经算出最短路的 即可。例题就是 P2738 篱笆回路。这题输入特别逆天，所以给了完整代码。123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102#include &lt;iostream&gt;#include &lt;algorithm&gt;using namespace std;typedef long long ll;const ll MAXN = 305;const ll INF = 2147483647;struct Edge{ ll u, v, w; bool lside[MAXN], rside[MAXN];}edge[MAXN]; ll adj[MAXN][MAXN], father[MAXN], m, n, idx[MAXN], dis[MAXN][MAXN];ll find(ll x){ if(father[x] == x)return x; return father[x] = find(father[x]);}void merge(ll x, ll y){ father[find(x)] = find(y);}ll Floyd(){ ll ans = INF; for(ll i = 1; i &lt;= n; i ++){ for(ll j = 1; j &lt;= n; j ++){ if(!dis[i][j])dis[i][j] = INF; if(!adj[i][j])adj[i][j] = INF; } } for(ll i = 1; i &lt;= n; i ++){ adj[i][i] = dis[i][i] = 0; } for(ll k = 1; k &lt;= n; k ++){ for(ll i = 1; i &lt;= k - 1; i ++){ for(ll j = i + 1; j &lt;= k - 1; j ++){ ans = min(ans, adj[i][k] + adj[k][j] + dis[i][j]); } } for(ll i = 1; i &lt;= n; i ++){ for(ll j = 1; j &lt;= n; j ++){ dis[i][j] = min(dis[i][j], dis[i][k] + dis[k][j]); } } } return ans;}int main(){ cin &gt;&gt; m; for(ll i = 1; i &lt;= m; i ++){ ll s, len, numl, numr, id; cin &gt;&gt; s &gt;&gt; len &gt;&gt; numl &gt;&gt; numr; edge[s].u = s * 2 - 1; edge[s].v = s * 2; edge[s].w = len; for(ll j = 1; j &lt;= numl; j ++){ cin &gt;&gt; id; edge[s].lside[id] = 1; } for(ll j = 1; j &lt;= numr; j ++){ cin &gt;&gt; id; edge[s].rside[id] = 1; } } for(ll i = 1; i &lt;= 250; i ++){ father[i] = i; } for(ll i = 1; i &lt;= m; i ++){ for(ll j = 1; j &lt;= m; j ++){ if(i == j)continue; if(edge[i].lside[j] &amp;&amp; edge[j].lside[i]){ merge(edge[i].u, edge[j].u); } if(edge[i].lside[j] &amp;&amp; edge[j].rside[i]){ merge(edge[i].u, edge[j].v); } if(edge[i].rside[j] &amp;&amp; edge[j].lside[i]){ merge(edge[i].v, edge[j].u); } if(edge[i].rside[j] &amp;&amp; edge[j].rside[i]){ merge(edge[i].v, edge[j].v); } } } for(ll i = 1; i &lt;= 2 * m; i ++){ if(father[i] == i){ idx[i] = ++n; } } for(ll i = 1; i &lt;= m; i ++){ edge[i].u = idx[find(edge[i].u)]; edge[i].v = idx[find(edge[i].v)]; adj[edge[i].u][edge[i].v] = edge[i].w; adj[edge[i].v][edge[i].u] = edge[i].w; dis[edge[i].u][edge[i].v] = edge[i].w; dis[edge[i].v][edge[i].u] = edge[i].w; } cout &lt;&lt; Floyd() &lt;&lt; \"\\n\"; return 0;} 总结Floyd 算法似乎从方方面面看都很平庸：时间复杂度高达 ，需要空间复杂度耗费较大的邻接矩阵存图，甚至连模板的使用环境都比较小。然而 Floyd 算法具有较高的灵活性、可读性和可写性。一旦深刻理解了它的原理，就可以加以变通，解决许许多多看似复杂的算法。以上就是例子，希望大家不要想我最初一样，只背了模板，没有思考含义。 Floyd 算法之所以被发明出来，并不是因为他比 Dijkstra 更快，比 SPFA 更好理解，而是因为，他善啊…… 推荐例题：洛谷 P1119 灾后重建，P1841 重要的城市","categories":[{"name":"Note","slug":"Note","permalink":"https://allen2010.github.io/categories/Note/"}],"tags":[{"name":"algorithm","slug":"algorithm","permalink":"https://allen2010.github.io/tags/algorithm/"},{"name":"shortest path","slug":"shortest-path","permalink":"https://allen2010.github.io/tags/shortest-path/"}]}],"categories":[{"name":"Favourite","slug":"Favourite","permalink":"https://allen2010.github.io/categories/Favourite/"},{"name":"Novel","slug":"Novel","permalink":"https://allen2010.github.io/categories/Novel/"},{"name":"Essay","slug":"Essay","permalink":"https://allen2010.github.io/categories/Essay/"},{"name":"Note","slug":"Note","permalink":"https://allen2010.github.io/categories/Note/"},{"name":"Works","slug":"Works","permalink":"https://allen2010.github.io/categories/Works/"}],"tags":[{"name":"minecraft","slug":"minecraft","permalink":"https://allen2010.github.io/tags/minecraft/"},{"name":"wall paper","slug":"wall-paper","permalink":"https://allen2010.github.io/tags/wall-paper/"},{"name":"fantasy","slug":"fantasy","permalink":"https://allen2010.github.io/tags/fantasy/"},{"name":"animate","slug":"animate","permalink":"https://allen2010.github.io/tags/animate/"},{"name":"alan becker","slug":"alan-becker","permalink":"https://allen2010.github.io/tags/alan-becker/"},{"name":"original","slug":"original","permalink":"https://allen2010.github.io/tags/original/"},{"name":"badminton","slug":"badminton","permalink":"https://allen2010.github.io/tags/badminton/"},{"name":"personal thought","slug":"personal-thought","permalink":"https://allen2010.github.io/tags/personal-thought/"},{"name":"algorithm","slug":"algorithm","permalink":"https://allen2010.github.io/tags/algorithm/"},{"name":"data structure","slug":"data-structure","permalink":"https://allen2010.github.io/tags/data-structure/"},{"name":"divide & conquer","slug":"divide-conquer","permalink":"https://allen2010.github.io/tags/divide-conquer/"},{"name":"sketch","slug":"sketch","permalink":"https://allen2010.github.io/tags/sketch/"},{"name":"design","slug":"design","permalink":"https://allen2010.github.io/tags/design/"},{"name":"binary lifting","slug":"binary-lifting","permalink":"https://allen2010.github.io/tags/binary-lifting/"},{"name":"shortest path","slug":"shortest-path","permalink":"https://allen2010.github.io/tags/shortest-path/"}]}